; ModuleID = 'mavlink_client.c'
source_filename = "mavlink_client.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__mavlink_status = type { i8, i8, i8, i32, i8, i8, i8, i16, i16, i8, i8, %struct.__mavlink_signing*, %struct.__mavlink_signing_streams* }
%struct.__mavlink_signing = type { i8, i8, i64, [32 x i8], i1 (%struct.__mavlink_status*, i32)* }
%struct.__mavlink_signing_streams = type { i16, [16 x %struct.__mavlink_signing_stream] }
%struct.__mavlink_signing_stream = type { i8, i8, i8, [6 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.__mavlink_message = type <{ i16, i8, i8, i8, i8, i8, i8, i8, [3 x i8], [33 x i64], [2 x i8], [13 x i8] }>
%struct.sockaddr = type { i16, [14 x i8] }
%struct.__mavlink_heartbeat_t = type { i32, i8, i8, i8, i8, i8 }
%struct.mavlink_sha256_ctx = type { [2 x i32], [8 x i32], %union.anon }
%union.anon = type { [16 x i32] }
%union.anon.0 = type { i64 }

@.str = private unnamed_addr constant [24 x i8] c"Error sending heartbeat\00", align 1
@.str.1 = private unnamed_addr constant [37 x i8] c"Sent heartbeat: sysid=%d, compid=%d\0A\00", align 1
@.str.2 = private unnamed_addr constant [22 x i8] c"Error creating socket\00", align 1
@.str.3 = private unnamed_addr constant [10 x i8] c"127.0.0.1\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "m_mavlink_status", scope: !2, file: !3, line: 29, type: !271, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "mavlink_get_channel_status", scope: !3, file: !3, line: 23, type: !4, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!3 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../mavlink_helpers.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-client/input/source_code/mavlink")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_status_t", file: !8, line: 233, baseType: !9)
!8 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../mavlink_types.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-client/input/source_code/mavlink")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_status", file: !8, line: 219, size: 320, elements: !10)
!10 = !{!11, !17, !18, !19, !40, !41, !42, !43, !47, !48, !49, !50, !74}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "msg_received", scope: !9, file: !8, line: 220, baseType: !12, size: 8)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 38, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_overrun", scope: !9, file: !8, line: 221, baseType: !12, size: 8, offset: 8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "parse_error", scope: !9, file: !8, line: 222, baseType: !12, size: 8, offset: 16)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "parse_state", scope: !9, file: !8, line: 223, baseType: !20, size: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_parse_state_t", file: !8, line: 203, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 186, baseType: !22, size: 32, elements: !23)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!24 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_UNINIT", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_IDLE", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_STX", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_LENGTH", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_INCOMPAT_FLAGS", value: 4, isUnsigned: true)
!29 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_COMPAT_FLAGS", value: 5, isUnsigned: true)
!30 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_SEQ", value: 6, isUnsigned: true)
!31 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_SYSID", value: 7, isUnsigned: true)
!32 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_COMPID", value: 8, isUnsigned: true)
!33 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_MSGID1", value: 9, isUnsigned: true)
!34 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_MSGID2", value: 10, isUnsigned: true)
!35 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_MSGID3", value: 11, isUnsigned: true)
!36 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_PAYLOAD", value: 12, isUnsigned: true)
!37 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_CRC1", value: 13, isUnsigned: true)
!38 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_BAD_CRC1", value: 14, isUnsigned: true)
!39 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_SIGNATURE_WAIT", value: 15, isUnsigned: true)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "packet_idx", scope: !9, file: !8, line: 224, baseType: !12, size: 8, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "current_rx_seq", scope: !9, file: !8, line: 225, baseType: !12, size: 8, offset: 72)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "current_tx_seq", scope: !9, file: !8, line: 226, baseType: !12, size: 8, offset: 80)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "packet_rx_success_count", scope: !9, file: !8, line: 227, baseType: !44, size: 16, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 25, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 40, baseType: !46)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "packet_rx_drop_count", scope: !9, file: !8, line: 228, baseType: !44, size: 16, offset: 112)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !9, file: !8, line: 229, baseType: !12, size: 8, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "signature_wait", scope: !9, file: !8, line: 230, baseType: !12, size: 8, offset: 136)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "signing", scope: !9, file: !8, line: 231, baseType: !51, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_signing", file: !8, line: 248, size: 448, elements: !53)
!53 = !{!54, !55, !56, !60, !64}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !8, line: 249, baseType: !12, size: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "link_id", scope: !52, file: !8, line: 250, baseType: !12, size: 8, offset: 8)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !52, file: !8, line: 251, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 27, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !15, line: 45, baseType: !59)
!59 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "secret_key", scope: !52, file: !8, line: 252, baseType: !61, size: 256, offset: 128)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 256, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "accept_unsigned_callback", scope: !52, file: !8, line: 253, baseType: !65, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_accept_unsigned_t", file: !8, line: 238, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !70, !72}
!69 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !22)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "signing_streams", scope: !9, file: !8, line: 232, baseType: !75, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_signing_streams", file: !8, line: 263, size: 1168, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "num_signing_streams", scope: !76, file: !8, line: 264, baseType: !44, size: 16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !76, file: !8, line: 270, baseType: !80, size: 1152, offset: 16)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 1152, elements: !90)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_signing_stream", file: !8, line: 265, size: 72, elements: !82)
!82 = !{!83, !84, !85, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "link_id", scope: !81, file: !8, line: 266, baseType: !12, size: 8)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sysid", scope: !81, file: !8, line: 267, baseType: !12, size: 8, offset: 8)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compid", scope: !81, file: !8, line: 268, baseType: !12, size: 8, offset: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_bytes", scope: !81, file: !8, line: 269, baseType: !87, size: 48, offset: 24)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 48, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 6)
!90 = !{!91}
!91 = !DISubrange(count: 16)
!92 = distinct !DICompileUnit(language: DW_LANG_C99, file: !93, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !240, globals: !262, splitDebugInlining: false, nameTableKind: None)
!93 = !DIFile(filename: "mavlink_client.c", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-client/input/source_code/mavlink")
!94 = !{!95, !142, !166, !181, !193, !205, !234, !21}
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MAV_TYPE", file: !96, line: 69, baseType: !22, size: 32, elements: !97)
!96 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../minimal/minimal.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-client/input/source_code/mavlink")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!98 = !DIEnumerator(name: "MAV_TYPE_GENERIC", value: 0, isUnsigned: true)
!99 = !DIEnumerator(name: "MAV_TYPE_FIXED_WING", value: 1, isUnsigned: true)
!100 = !DIEnumerator(name: "MAV_TYPE_QUADROTOR", value: 2, isUnsigned: true)
!101 = !DIEnumerator(name: "MAV_TYPE_COAXIAL", value: 3, isUnsigned: true)
!102 = !DIEnumerator(name: "MAV_TYPE_HELICOPTER", value: 4, isUnsigned: true)
!103 = !DIEnumerator(name: "MAV_TYPE_ANTENNA_TRACKER", value: 5, isUnsigned: true)
!104 = !DIEnumerator(name: "MAV_TYPE_GCS", value: 6, isUnsigned: true)
!105 = !DIEnumerator(name: "MAV_TYPE_AIRSHIP", value: 7, isUnsigned: true)
!106 = !DIEnumerator(name: "MAV_TYPE_FREE_BALLOON", value: 8, isUnsigned: true)
!107 = !DIEnumerator(name: "MAV_TYPE_ROCKET", value: 9, isUnsigned: true)
!108 = !DIEnumerator(name: "MAV_TYPE_GROUND_ROVER", value: 10, isUnsigned: true)
!109 = !DIEnumerator(name: "MAV_TYPE_SURFACE_BOAT", value: 11, isUnsigned: true)
!110 = !DIEnumerator(name: "MAV_TYPE_SUBMARINE", value: 12, isUnsigned: true)
!111 = !DIEnumerator(name: "MAV_TYPE_HEXAROTOR", value: 13, isUnsigned: true)
!112 = !DIEnumerator(name: "MAV_TYPE_OCTOROTOR", value: 14, isUnsigned: true)
!113 = !DIEnumerator(name: "MAV_TYPE_TRICOPTER", value: 15, isUnsigned: true)
!114 = !DIEnumerator(name: "MAV_TYPE_FLAPPING_WING", value: 16, isUnsigned: true)
!115 = !DIEnumerator(name: "MAV_TYPE_KITE", value: 17, isUnsigned: true)
!116 = !DIEnumerator(name: "MAV_TYPE_ONBOARD_CONTROLLER", value: 18, isUnsigned: true)
!117 = !DIEnumerator(name: "MAV_TYPE_VTOL_DUOROTOR", value: 19, isUnsigned: true)
!118 = !DIEnumerator(name: "MAV_TYPE_VTOL_QUADROTOR", value: 20, isUnsigned: true)
!119 = !DIEnumerator(name: "MAV_TYPE_VTOL_TILTROTOR", value: 21, isUnsigned: true)
!120 = !DIEnumerator(name: "MAV_TYPE_VTOL_RESERVED2", value: 22, isUnsigned: true)
!121 = !DIEnumerator(name: "MAV_TYPE_VTOL_RESERVED3", value: 23, isUnsigned: true)
!122 = !DIEnumerator(name: "MAV_TYPE_VTOL_RESERVED4", value: 24, isUnsigned: true)
!123 = !DIEnumerator(name: "MAV_TYPE_VTOL_RESERVED5", value: 25, isUnsigned: true)
!124 = !DIEnumerator(name: "MAV_TYPE_GIMBAL", value: 26, isUnsigned: true)
!125 = !DIEnumerator(name: "MAV_TYPE_ADSB", value: 27, isUnsigned: true)
!126 = !DIEnumerator(name: "MAV_TYPE_PARAFOIL", value: 28, isUnsigned: true)
!127 = !DIEnumerator(name: "MAV_TYPE_DODECAROTOR", value: 29, isUnsigned: true)
!128 = !DIEnumerator(name: "MAV_TYPE_CAMERA", value: 30, isUnsigned: true)
!129 = !DIEnumerator(name: "MAV_TYPE_CHARGING_STATION", value: 31, isUnsigned: true)
!130 = !DIEnumerator(name: "MAV_TYPE_FLARM", value: 32, isUnsigned: true)
!131 = !DIEnumerator(name: "MAV_TYPE_SERVO", value: 33, isUnsigned: true)
!132 = !DIEnumerator(name: "MAV_TYPE_ODID", value: 34, isUnsigned: true)
!133 = !DIEnumerator(name: "MAV_TYPE_DECAROTOR", value: 35, isUnsigned: true)
!134 = !DIEnumerator(name: "MAV_TYPE_BATTERY", value: 36, isUnsigned: true)
!135 = !DIEnumerator(name: "MAV_TYPE_PARACHUTE", value: 37, isUnsigned: true)
!136 = !DIEnumerator(name: "MAV_TYPE_LOG", value: 38, isUnsigned: true)
!137 = !DIEnumerator(name: "MAV_TYPE_OSD", value: 39, isUnsigned: true)
!138 = !DIEnumerator(name: "MAV_TYPE_IMU", value: 40, isUnsigned: true)
!139 = !DIEnumerator(name: "MAV_TYPE_GPS", value: 41, isUnsigned: true)
!140 = !DIEnumerator(name: "MAV_TYPE_WINCH", value: 42, isUnsigned: true)
!141 = !DIEnumerator(name: "MAV_TYPE_ENUM_END", value: 43, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MAV_AUTOPILOT", file: !96, line: 39, baseType: !22, size: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165}
!144 = !DIEnumerator(name: "MAV_AUTOPILOT_GENERIC", value: 0, isUnsigned: true)
!145 = !DIEnumerator(name: "MAV_AUTOPILOT_RESERVED", value: 1, isUnsigned: true)
!146 = !DIEnumerator(name: "MAV_AUTOPILOT_SLUGS", value: 2, isUnsigned: true)
!147 = !DIEnumerator(name: "MAV_AUTOPILOT_ARDUPILOTMEGA", value: 3, isUnsigned: true)
!148 = !DIEnumerator(name: "MAV_AUTOPILOT_OPENPILOT", value: 4, isUnsigned: true)
!149 = !DIEnumerator(name: "MAV_AUTOPILOT_GENERIC_WAYPOINTS_ONLY", value: 5, isUnsigned: true)
!150 = !DIEnumerator(name: "MAV_AUTOPILOT_GENERIC_WAYPOINTS_AND_SIMPLE_NAVIGATION_ONLY", value: 6, isUnsigned: true)
!151 = !DIEnumerator(name: "MAV_AUTOPILOT_GENERIC_MISSION_FULL", value: 7, isUnsigned: true)
!152 = !DIEnumerator(name: "MAV_AUTOPILOT_INVALID", value: 8, isUnsigned: true)
!153 = !DIEnumerator(name: "MAV_AUTOPILOT_PPZ", value: 9, isUnsigned: true)
!154 = !DIEnumerator(name: "MAV_AUTOPILOT_UDB", value: 10, isUnsigned: true)
!155 = !DIEnumerator(name: "MAV_AUTOPILOT_FP", value: 11, isUnsigned: true)
!156 = !DIEnumerator(name: "MAV_AUTOPILOT_PX4", value: 12, isUnsigned: true)
!157 = !DIEnumerator(name: "MAV_AUTOPILOT_SMACCMPILOT", value: 13, isUnsigned: true)
!158 = !DIEnumerator(name: "MAV_AUTOPILOT_AUTOQUAD", value: 14, isUnsigned: true)
!159 = !DIEnumerator(name: "MAV_AUTOPILOT_ARMAZILA", value: 15, isUnsigned: true)
!160 = !DIEnumerator(name: "MAV_AUTOPILOT_AEROB", value: 16, isUnsigned: true)
!161 = !DIEnumerator(name: "MAV_AUTOPILOT_ASLUAV", value: 17, isUnsigned: true)
!162 = !DIEnumerator(name: "MAV_AUTOPILOT_SMARTAP", value: 18, isUnsigned: true)
!163 = !DIEnumerator(name: "MAV_AUTOPILOT_AIRRAILS", value: 19, isUnsigned: true)
!164 = !DIEnumerator(name: "MAV_AUTOPILOT_REFLEX", value: 20, isUnsigned: true)
!165 = !DIEnumerator(name: "MAV_AUTOPILOT_ENUM_END", value: 21, isUnsigned: true)
!166 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MAV_MODE", file: !167, line: 90, baseType: !22, size: 32, elements: !168)
!167 = !DIFile(filename: "generated/include/mavlink/v2.0/common/common.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-client/input/source_code/mavlink")
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!169 = !DIEnumerator(name: "MAV_MODE_PREFLIGHT", value: 0, isUnsigned: true)
!170 = !DIEnumerator(name: "MAV_MODE_MANUAL_DISARMED", value: 64, isUnsigned: true)
!171 = !DIEnumerator(name: "MAV_MODE_TEST_DISARMED", value: 66, isUnsigned: true)
!172 = !DIEnumerator(name: "MAV_MODE_STABILIZE_DISARMED", value: 80, isUnsigned: true)
!173 = !DIEnumerator(name: "MAV_MODE_GUIDED_DISARMED", value: 88, isUnsigned: true)
!174 = !DIEnumerator(name: "MAV_MODE_AUTO_DISARMED", value: 92, isUnsigned: true)
!175 = !DIEnumerator(name: "MAV_MODE_MANUAL_ARMED", value: 192, isUnsigned: true)
!176 = !DIEnumerator(name: "MAV_MODE_TEST_ARMED", value: 194, isUnsigned: true)
!177 = !DIEnumerator(name: "MAV_MODE_STABILIZE_ARMED", value: 208, isUnsigned: true)
!178 = !DIEnumerator(name: "MAV_MODE_GUIDED_ARMED", value: 216, isUnsigned: true)
!179 = !DIEnumerator(name: "MAV_MODE_AUTO_ARMED", value: 220, isUnsigned: true)
!180 = !DIEnumerator(name: "MAV_MODE_ENUM_END", value: 221, isUnsigned: true)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MAV_STATE", file: !96, line: 155, baseType: !22, size: 32, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192}
!183 = !DIEnumerator(name: "MAV_STATE_UNINIT", value: 0, isUnsigned: true)
!184 = !DIEnumerator(name: "MAV_STATE_BOOT", value: 1, isUnsigned: true)
!185 = !DIEnumerator(name: "MAV_STATE_CALIBRATING", value: 2, isUnsigned: true)
!186 = !DIEnumerator(name: "MAV_STATE_STANDBY", value: 3, isUnsigned: true)
!187 = !DIEnumerator(name: "MAV_STATE_ACTIVE", value: 4, isUnsigned: true)
!188 = !DIEnumerator(name: "MAV_STATE_CRITICAL", value: 5, isUnsigned: true)
!189 = !DIEnumerator(name: "MAV_STATE_EMERGENCY", value: 6, isUnsigned: true)
!190 = !DIEnumerator(name: "MAV_STATE_POWEROFF", value: 7, isUnsigned: true)
!191 = !DIEnumerator(name: "MAV_STATE_FLIGHT_TERMINATION", value: 8, isUnsigned: true)
!192 = !DIEnumerator(name: "MAV_STATE_ENUM_END", value: 9, isUnsigned: true)
!193 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !194, line: 24, baseType: !22, size: 32, elements: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204}
!196 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!197 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!198 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!199 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!200 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!201 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!202 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!203 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!204 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !206, line: 40, baseType: !22, size: 32, elements: !207)
!206 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!208 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!209 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!210 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!211 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!212 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!213 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!214 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!215 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!216 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!217 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!218 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!219 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!220 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!221 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!222 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!223 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!224 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!225 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!226 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!227 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!228 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!229 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!230 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!231 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!232 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!233 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 165, baseType: !22, size: 32, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIEnumerator(name: "MAVLINK_COMM_0", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "MAVLINK_COMM_1", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "MAVLINK_COMM_2", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "MAVLINK_COMM_3", value: 3, isUnsigned: true)
!240 = !{!241, !253, !254, !12, !256, !44, !257, !259, !260}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !243, line: 178, size: 128, elements: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!244 = !{!245, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !242, file: !243, line: 180, baseType: !246, size: 16)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !247, line: 28, baseType: !46)
!247 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !242, file: !243, line: 181, baseType: !249, size: 112, offset: 16)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 112, elements: !251)
!250 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!251 = !{!252}
!252 = !DISubrange(count: 14)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!262 = !{!0, !263}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "mavlink_sha256_constant_256", scope: !92, file: !265, line: 72, type: !266, isLocal: true, isDefinition: true)
!265 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../mavlink_sha256.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-client/input/source_code/mavlink")
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 2048, elements: !268)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!268 = !{!269}
!269 = !DISubrange(count: 64)
!270 = !{}
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 5120, elements: !90)
!272 = !{i32 7, !"Dwarf Version", i32 4}
!273 = !{i32 2, !"Debug Info Version", i32 3}
!274 = !{i32 1, !"wchar_size", i32 4}
!275 = !{!"clang version 10.0.0-4ubuntu1 "}
!276 = distinct !DISubprogram(name: "send_heartbeat", scope: !93, file: !93, line: 20, type: !277, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !270)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !280}
!279 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !206, line: 238, size: 128, elements: !282)
!282 = !{!283, !284, !286, !291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !281, file: !206, line: 240, baseType: !246, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !281, file: !206, line: 241, baseType: !285, size: 16, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !206, line: 119, baseType: !44)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !281, file: !206, line: 242, baseType: !287, size: 32, offset: 32)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !206, line: 31, size: 32, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !287, file: !206, line: 33, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !206, line: 30, baseType: !72)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !281, file: !206, line: 245, baseType: !292, size: 64, offset: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 8)
!295 = !DILocalVariable(name: "sock", arg: 1, scope: !276, file: !93, line: 20, type: !279)
!296 = !DILocation(line: 20, column: 25, scope: !276)
!297 = !DILocalVariable(name: "dest_addr", arg: 2, scope: !276, file: !93, line: 20, type: !280)
!298 = !DILocation(line: 20, column: 51, scope: !276)
!299 = !DILocalVariable(name: "msg", scope: !276, file: !93, line: 21, type: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_message_t", file: !8, line: 121, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_message", file: !8, line: 107, size: 2328, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !316, !320}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !301, file: !8, line: 107, baseType: !44, size: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !301, file: !8, line: 107, baseType: !12, size: 8, offset: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !301, file: !8, line: 107, baseType: !12, size: 8, offset: 24)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "incompat_flags", scope: !301, file: !8, line: 107, baseType: !12, size: 8, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "compat_flags", scope: !301, file: !8, line: 107, baseType: !12, size: 8, offset: 40)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !301, file: !8, line: 107, baseType: !12, size: 8, offset: 48)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sysid", scope: !301, file: !8, line: 107, baseType: !12, size: 8, offset: 56)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "compid", scope: !301, file: !8, line: 107, baseType: !12, size: 8, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "msgid", scope: !301, file: !8, line: 107, baseType: !72, size: 24, offset: 72, flags: DIFlagBitField, extraData: i64 72)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "payload64", scope: !301, file: !8, line: 107, baseType: !313, size: 2112, offset: 96)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2112, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 33)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ck", scope: !301, file: !8, line: 107, baseType: !317, size: 16, offset: 2208)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 2)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !301, file: !8, line: 107, baseType: !321, size: 104, offset: 2224)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 104, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 13)
!324 = !DILocation(line: 21, column: 23, scope: !276)
!325 = !DILocalVariable(name: "buf", scope: !276, file: !93, line: 22, type: !326)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16328, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 2041)
!329 = !DILocation(line: 22, column: 13, scope: !276)
!330 = !DILocalVariable(name: "len", scope: !276, file: !93, line: 23, type: !44)
!331 = !DILocation(line: 23, column: 14, scope: !276)
!332 = !DILocalVariable(name: "sysid", scope: !276, file: !93, line: 25, type: !12)
!333 = !DILocation(line: 25, column: 13, scope: !276)
!334 = !DILocalVariable(name: "compid", scope: !276, file: !93, line: 26, type: !12)
!335 = !DILocation(line: 26, column: 13, scope: !276)
!336 = !DILocalVariable(name: "type", scope: !276, file: !93, line: 27, type: !12)
!337 = !DILocation(line: 27, column: 13, scope: !276)
!338 = !DILocalVariable(name: "autopilot", scope: !276, file: !93, line: 28, type: !12)
!339 = !DILocation(line: 28, column: 13, scope: !276)
!340 = !DILocalVariable(name: "base_mode", scope: !276, file: !93, line: 29, type: !12)
!341 = !DILocation(line: 29, column: 13, scope: !276)
!342 = !DILocalVariable(name: "custom_mode", scope: !276, file: !93, line: 30, type: !72)
!343 = !DILocation(line: 30, column: 14, scope: !276)
!344 = !DILocalVariable(name: "system_status", scope: !276, file: !93, line: 31, type: !12)
!345 = !DILocation(line: 31, column: 13, scope: !276)
!346 = !DILocation(line: 35, column: 9, scope: !276)
!347 = !DILocation(line: 36, column: 9, scope: !276)
!348 = !DILocation(line: 43, column: 9, scope: !276)
!349 = !DILocation(line: 44, column: 9, scope: !276)
!350 = !DILocation(line: 45, column: 9, scope: !276)
!351 = !DILocation(line: 46, column: 9, scope: !276)
!352 = !DILocation(line: 47, column: 9, scope: !276)
!353 = !DILocation(line: 34, column: 5, scope: !276)
!354 = !DILocation(line: 51, column: 38, scope: !276)
!355 = !DILocation(line: 51, column: 11, scope: !276)
!356 = !DILocation(line: 51, column: 9, scope: !276)
!357 = !DILocation(line: 54, column: 16, scope: !358)
!358 = distinct !DILexicalBlock(scope: !276, file: !93, line: 54, column: 9)
!359 = !DILocation(line: 54, column: 22, scope: !358)
!360 = !DILocation(line: 54, column: 27, scope: !358)
!361 = !DILocation(line: 54, column: 54, scope: !358)
!362 = !DILocation(line: 54, column: 35, scope: !358)
!363 = !DILocation(line: 54, column: 9, scope: !358)
!364 = !DILocation(line: 54, column: 93, scope: !358)
!365 = !DILocation(line: 54, column: 9, scope: !276)
!366 = !DILocation(line: 55, column: 9, scope: !367)
!367 = distinct !DILexicalBlock(scope: !358, file: !93, line: 54, column: 98)
!368 = !DILocation(line: 56, column: 5, scope: !367)
!369 = !DILocation(line: 57, column: 9, scope: !370)
!370 = distinct !DILexicalBlock(scope: !358, file: !93, line: 56, column: 12)
!371 = !DILocation(line: 59, column: 1, scope: !276)
!372 = distinct !DISubprogram(name: "mavlink_msg_heartbeat_pack", scope: !373, file: !373, line: 68, type: !374, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!373 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../minimal/./mavlink_msg_heartbeat.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-client/input/source_code/mavlink")
!374 = !DISubroutineType(types: !375)
!375 = !{!44, !12, !12, !376, !12, !12, !12, !72, !12}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!377 = !DILocalVariable(name: "system_id", arg: 1, scope: !372, file: !373, line: 68, type: !12)
!378 = !DILocation(line: 68, column: 59, scope: !372)
!379 = !DILocalVariable(name: "component_id", arg: 2, scope: !372, file: !373, line: 68, type: !12)
!380 = !DILocation(line: 68, column: 78, scope: !372)
!381 = !DILocalVariable(name: "msg", arg: 3, scope: !372, file: !373, line: 68, type: !376)
!382 = !DILocation(line: 68, column: 111, scope: !372)
!383 = !DILocalVariable(name: "type", arg: 4, scope: !372, file: !373, line: 69, type: !12)
!384 = !DILocation(line: 69, column: 40, scope: !372)
!385 = !DILocalVariable(name: "autopilot", arg: 5, scope: !372, file: !373, line: 69, type: !12)
!386 = !DILocation(line: 69, column: 54, scope: !372)
!387 = !DILocalVariable(name: "base_mode", arg: 6, scope: !372, file: !373, line: 69, type: !12)
!388 = !DILocation(line: 69, column: 73, scope: !372)
!389 = !DILocalVariable(name: "custom_mode", arg: 7, scope: !372, file: !373, line: 69, type: !72)
!390 = !DILocation(line: 69, column: 93, scope: !372)
!391 = !DILocalVariable(name: "system_status", arg: 8, scope: !372, file: !373, line: 69, type: !12)
!392 = !DILocation(line: 69, column: 114, scope: !372)
!393 = !DILocalVariable(name: "packet", scope: !372, file: !373, line: 91, type: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_heartbeat_t", file: !373, line: 16, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_heartbeat_t", file: !373, line: 9, size: 96, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "custom_mode", scope: !395, file: !373, line: 10, baseType: !72, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !395, file: !373, line: 11, baseType: !12, size: 8, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "autopilot", scope: !395, file: !373, line: 12, baseType: !12, size: 8, offset: 40)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "base_mode", scope: !395, file: !373, line: 13, baseType: !12, size: 8, offset: 48)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "system_status", scope: !395, file: !373, line: 14, baseType: !12, size: 8, offset: 56)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mavlink_version", scope: !395, file: !373, line: 15, baseType: !12, size: 8, offset: 64)
!403 = !DILocation(line: 91, column: 25, scope: !372)
!404 = !DILocation(line: 92, column: 26, scope: !372)
!405 = !DILocation(line: 92, column: 12, scope: !372)
!406 = !DILocation(line: 92, column: 24, scope: !372)
!407 = !DILocation(line: 93, column: 19, scope: !372)
!408 = !DILocation(line: 93, column: 12, scope: !372)
!409 = !DILocation(line: 93, column: 17, scope: !372)
!410 = !DILocation(line: 94, column: 24, scope: !372)
!411 = !DILocation(line: 94, column: 12, scope: !372)
!412 = !DILocation(line: 94, column: 22, scope: !372)
!413 = !DILocation(line: 95, column: 24, scope: !372)
!414 = !DILocation(line: 95, column: 12, scope: !372)
!415 = !DILocation(line: 95, column: 22, scope: !372)
!416 = !DILocation(line: 96, column: 28, scope: !372)
!417 = !DILocation(line: 96, column: 12, scope: !372)
!418 = !DILocation(line: 96, column: 26, scope: !372)
!419 = !DILocation(line: 97, column: 12, scope: !372)
!420 = !DILocation(line: 97, column: 28, scope: !372)
!421 = !DILocation(line: 99, column: 16, scope: !372)
!422 = !DILocation(line: 99, column: 9, scope: !372)
!423 = !DILocation(line: 102, column: 5, scope: !372)
!424 = !DILocation(line: 102, column: 10, scope: !372)
!425 = !DILocation(line: 102, column: 16, scope: !372)
!426 = !DILocation(line: 103, column: 37, scope: !372)
!427 = !DILocation(line: 103, column: 42, scope: !372)
!428 = !DILocation(line: 103, column: 53, scope: !372)
!429 = !DILocation(line: 103, column: 12, scope: !372)
!430 = !DILocation(line: 103, column: 5, scope: !372)
!431 = distinct !DISubprogram(name: "mavlink_msg_to_send_buffer", scope: !3, file: !3, line: 439, type: !432, scopeLine: 440, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!432 = !DISubroutineType(types: !433)
!433 = !{!44, !256, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!436 = !DILocalVariable(name: "buf", arg: 1, scope: !431, file: !3, line: 439, type: !256)
!437 = !DILocation(line: 439, column: 61, scope: !431)
!438 = !DILocalVariable(name: "msg", arg: 2, scope: !431, file: !3, line: 439, type: !434)
!439 = !DILocation(line: 439, column: 91, scope: !431)
!440 = !DILocalVariable(name: "signature_len", scope: !431, file: !3, line: 441, type: !12)
!441 = !DILocation(line: 441, column: 10, scope: !431)
!442 = !DILocalVariable(name: "header_len", scope: !431, file: !3, line: 441, type: !12)
!443 = !DILocation(line: 441, column: 25, scope: !431)
!444 = !DILocalVariable(name: "ck", scope: !431, file: !3, line: 442, type: !256)
!445 = !DILocation(line: 442, column: 11, scope: !431)
!446 = !DILocalVariable(name: "length", scope: !431, file: !3, line: 443, type: !12)
!447 = !DILocation(line: 443, column: 17, scope: !431)
!448 = !DILocation(line: 443, column: 26, scope: !431)
!449 = !DILocation(line: 443, column: 31, scope: !431)
!450 = !DILocation(line: 445, column: 6, scope: !451)
!451 = distinct !DILexicalBlock(scope: !431, file: !3, line: 445, column: 6)
!452 = !DILocation(line: 445, column: 11, scope: !451)
!453 = !DILocation(line: 445, column: 17, scope: !451)
!454 = !DILocation(line: 445, column: 6, scope: !431)
!455 = !DILocation(line: 446, column: 17, scope: !456)
!456 = distinct !DILexicalBlock(scope: !451, file: !3, line: 445, column: 42)
!457 = !DILocation(line: 447, column: 14, scope: !456)
!458 = !DILocation(line: 448, column: 12, scope: !456)
!459 = !DILocation(line: 448, column: 17, scope: !456)
!460 = !DILocation(line: 448, column: 3, scope: !456)
!461 = !DILocation(line: 448, column: 10, scope: !456)
!462 = !DILocation(line: 449, column: 12, scope: !456)
!463 = !DILocation(line: 449, column: 3, scope: !456)
!464 = !DILocation(line: 449, column: 10, scope: !456)
!465 = !DILocation(line: 450, column: 12, scope: !456)
!466 = !DILocation(line: 450, column: 17, scope: !456)
!467 = !DILocation(line: 450, column: 3, scope: !456)
!468 = !DILocation(line: 450, column: 10, scope: !456)
!469 = !DILocation(line: 451, column: 12, scope: !456)
!470 = !DILocation(line: 451, column: 17, scope: !456)
!471 = !DILocation(line: 451, column: 3, scope: !456)
!472 = !DILocation(line: 451, column: 10, scope: !456)
!473 = !DILocation(line: 452, column: 12, scope: !456)
!474 = !DILocation(line: 452, column: 17, scope: !456)
!475 = !DILocation(line: 452, column: 3, scope: !456)
!476 = !DILocation(line: 452, column: 10, scope: !456)
!477 = !DILocation(line: 453, column: 12, scope: !456)
!478 = !DILocation(line: 453, column: 17, scope: !456)
!479 = !DILocation(line: 453, column: 23, scope: !456)
!480 = !DILocation(line: 453, column: 3, scope: !456)
!481 = !DILocation(line: 453, column: 10, scope: !456)
!482 = !DILocation(line: 454, column: 11, scope: !456)
!483 = !DILocation(line: 454, column: 19, scope: !456)
!484 = !DILocation(line: 454, column: 3, scope: !456)
!485 = !DILocation(line: 454, column: 38, scope: !456)
!486 = !DILocation(line: 454, column: 43, scope: !456)
!487 = !DILocation(line: 455, column: 8, scope: !456)
!488 = !DILocation(line: 455, column: 14, scope: !456)
!489 = !DILocation(line: 455, column: 12, scope: !456)
!490 = !DILocation(line: 455, column: 25, scope: !456)
!491 = !DILocation(line: 455, column: 41, scope: !456)
!492 = !DILocation(line: 455, column: 46, scope: !456)
!493 = !DILocation(line: 455, column: 31, scope: !456)
!494 = !DILocation(line: 455, column: 29, scope: !456)
!495 = !DILocation(line: 455, column: 6, scope: !456)
!496 = !DILocation(line: 456, column: 2, scope: !456)
!497 = !DILocation(line: 457, column: 30, scope: !498)
!498 = distinct !DILexicalBlock(scope: !451, file: !3, line: 456, column: 9)
!499 = !DILocation(line: 457, column: 49, scope: !498)
!500 = !DILocation(line: 457, column: 12, scope: !498)
!501 = !DILocation(line: 457, column: 10, scope: !498)
!502 = !DILocation(line: 458, column: 14, scope: !498)
!503 = !DILocation(line: 459, column: 12, scope: !498)
!504 = !DILocation(line: 459, column: 17, scope: !498)
!505 = !DILocation(line: 459, column: 3, scope: !498)
!506 = !DILocation(line: 459, column: 10, scope: !498)
!507 = !DILocation(line: 460, column: 12, scope: !498)
!508 = !DILocation(line: 460, column: 3, scope: !498)
!509 = !DILocation(line: 460, column: 10, scope: !498)
!510 = !DILocation(line: 461, column: 12, scope: !498)
!511 = !DILocation(line: 461, column: 17, scope: !498)
!512 = !DILocation(line: 461, column: 3, scope: !498)
!513 = !DILocation(line: 461, column: 10, scope: !498)
!514 = !DILocation(line: 462, column: 12, scope: !498)
!515 = !DILocation(line: 462, column: 17, scope: !498)
!516 = !DILocation(line: 462, column: 3, scope: !498)
!517 = !DILocation(line: 462, column: 10, scope: !498)
!518 = !DILocation(line: 463, column: 12, scope: !498)
!519 = !DILocation(line: 463, column: 17, scope: !498)
!520 = !DILocation(line: 463, column: 3, scope: !498)
!521 = !DILocation(line: 463, column: 10, scope: !498)
!522 = !DILocation(line: 464, column: 12, scope: !498)
!523 = !DILocation(line: 464, column: 17, scope: !498)
!524 = !DILocation(line: 464, column: 3, scope: !498)
!525 = !DILocation(line: 464, column: 10, scope: !498)
!526 = !DILocation(line: 465, column: 12, scope: !498)
!527 = !DILocation(line: 465, column: 17, scope: !498)
!528 = !DILocation(line: 465, column: 3, scope: !498)
!529 = !DILocation(line: 465, column: 10, scope: !498)
!530 = !DILocation(line: 466, column: 12, scope: !498)
!531 = !DILocation(line: 466, column: 17, scope: !498)
!532 = !DILocation(line: 466, column: 23, scope: !498)
!533 = !DILocation(line: 466, column: 3, scope: !498)
!534 = !DILocation(line: 466, column: 10, scope: !498)
!535 = !DILocation(line: 467, column: 13, scope: !498)
!536 = !DILocation(line: 467, column: 18, scope: !498)
!537 = !DILocation(line: 467, column: 24, scope: !498)
!538 = !DILocation(line: 467, column: 30, scope: !498)
!539 = !DILocation(line: 467, column: 12, scope: !498)
!540 = !DILocation(line: 467, column: 3, scope: !498)
!541 = !DILocation(line: 467, column: 10, scope: !498)
!542 = !DILocation(line: 468, column: 13, scope: !498)
!543 = !DILocation(line: 468, column: 18, scope: !498)
!544 = !DILocation(line: 468, column: 24, scope: !498)
!545 = !DILocation(line: 468, column: 31, scope: !498)
!546 = !DILocation(line: 468, column: 12, scope: !498)
!547 = !DILocation(line: 468, column: 3, scope: !498)
!548 = !DILocation(line: 468, column: 10, scope: !498)
!549 = !DILocation(line: 469, column: 11, scope: !498)
!550 = !DILocation(line: 469, column: 20, scope: !498)
!551 = !DILocation(line: 469, column: 3, scope: !498)
!552 = !DILocation(line: 469, column: 39, scope: !498)
!553 = !DILocation(line: 470, column: 8, scope: !498)
!554 = !DILocation(line: 470, column: 14, scope: !498)
!555 = !DILocation(line: 470, column: 12, scope: !498)
!556 = !DILocation(line: 470, column: 25, scope: !498)
!557 = !DILocation(line: 470, column: 41, scope: !498)
!558 = !DILocation(line: 470, column: 31, scope: !498)
!559 = !DILocation(line: 470, column: 29, scope: !498)
!560 = !DILocation(line: 470, column: 6, scope: !498)
!561 = !DILocation(line: 471, column: 20, scope: !498)
!562 = !DILocation(line: 471, column: 25, scope: !498)
!563 = !DILocation(line: 471, column: 40, scope: !498)
!564 = !DILocation(line: 471, column: 19, scope: !498)
!565 = !DILocation(line: 471, column: 17, scope: !498)
!566 = !DILocation(line: 473, column: 20, scope: !431)
!567 = !DILocation(line: 473, column: 25, scope: !431)
!568 = !DILocation(line: 473, column: 34, scope: !431)
!569 = !DILocation(line: 473, column: 10, scope: !431)
!570 = !DILocation(line: 473, column: 2, scope: !431)
!571 = !DILocation(line: 473, column: 8, scope: !431)
!572 = !DILocation(line: 474, column: 20, scope: !431)
!573 = !DILocation(line: 474, column: 25, scope: !431)
!574 = !DILocation(line: 474, column: 34, scope: !431)
!575 = !DILocation(line: 474, column: 10, scope: !431)
!576 = !DILocation(line: 474, column: 2, scope: !431)
!577 = !DILocation(line: 474, column: 8, scope: !431)
!578 = !DILocation(line: 475, column: 6, scope: !579)
!579 = distinct !DILexicalBlock(scope: !431, file: !3, line: 475, column: 6)
!580 = !DILocation(line: 475, column: 20, scope: !579)
!581 = !DILocation(line: 475, column: 6, scope: !431)
!582 = !DILocation(line: 476, column: 11, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !3, line: 475, column: 25)
!584 = !DILocation(line: 476, column: 18, scope: !583)
!585 = !DILocation(line: 476, column: 23, scope: !583)
!586 = !DILocation(line: 476, column: 3, scope: !583)
!587 = !DILocation(line: 476, column: 34, scope: !583)
!588 = !DILocation(line: 477, column: 2, scope: !583)
!589 = !DILocation(line: 479, column: 9, scope: !431)
!590 = !DILocation(line: 479, column: 20, scope: !431)
!591 = !DILocation(line: 479, column: 24, scope: !431)
!592 = !DILocation(line: 479, column: 40, scope: !431)
!593 = !DILocation(line: 479, column: 30, scope: !431)
!594 = !DILocation(line: 479, column: 28, scope: !431)
!595 = !DILocation(line: 479, column: 59, scope: !431)
!596 = !DILocation(line: 479, column: 49, scope: !431)
!597 = !DILocation(line: 479, column: 47, scope: !431)
!598 = !DILocation(line: 479, column: 2, scope: !431)
!599 = distinct !DISubprogram(name: "main", scope: !93, file: !93, line: 61, type: !600, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !92, retainedNodes: !270)
!600 = !DISubroutineType(types: !601)
!601 = !{!279}
!602 = !DILocalVariable(name: "sock", scope: !599, file: !93, line: 63, type: !279)
!603 = !DILocation(line: 63, column: 9, scope: !599)
!604 = !DILocation(line: 63, column: 16, scope: !599)
!605 = !DILocation(line: 64, column: 9, scope: !606)
!606 = distinct !DILexicalBlock(scope: !599, file: !93, line: 64, column: 9)
!607 = !DILocation(line: 64, column: 14, scope: !606)
!608 = !DILocation(line: 64, column: 9, scope: !599)
!609 = !DILocation(line: 65, column: 9, scope: !610)
!610 = distinct !DILexicalBlock(scope: !606, file: !93, line: 64, column: 19)
!611 = !DILocation(line: 66, column: 9, scope: !610)
!612 = !DILocalVariable(name: "flags", scope: !599, file: !93, line: 70, type: !279)
!613 = !DILocation(line: 70, column: 9, scope: !599)
!614 = !DILocation(line: 70, column: 23, scope: !599)
!615 = !DILocation(line: 70, column: 17, scope: !599)
!616 = !DILocation(line: 71, column: 11, scope: !599)
!617 = !DILocation(line: 71, column: 26, scope: !599)
!618 = !DILocation(line: 71, column: 32, scope: !599)
!619 = !DILocation(line: 71, column: 5, scope: !599)
!620 = !DILocalVariable(name: "dest_addr", scope: !599, file: !93, line: 74, type: !281)
!621 = !DILocation(line: 74, column: 24, scope: !599)
!622 = !DILocation(line: 75, column: 5, scope: !599)
!623 = !DILocation(line: 76, column: 15, scope: !599)
!624 = !DILocation(line: 76, column: 26, scope: !599)
!625 = !DILocation(line: 77, column: 26, scope: !599)
!626 = !DILocation(line: 77, column: 15, scope: !599)
!627 = !DILocation(line: 77, column: 24, scope: !599)
!628 = !DILocation(line: 78, column: 46, scope: !599)
!629 = !DILocation(line: 78, column: 35, scope: !599)
!630 = !DILocation(line: 78, column: 5, scope: !599)
!631 = !DILocation(line: 81, column: 5, scope: !599)
!632 = !DILocation(line: 82, column: 24, scope: !633)
!633 = distinct !DILexicalBlock(scope: !599, file: !93, line: 81, column: 15)
!634 = !DILocation(line: 82, column: 9, scope: !633)
!635 = !DILocation(line: 83, column: 9, scope: !633)
!636 = distinct !{!636, !631, !637}
!637 = !DILocation(line: 84, column: 5, scope: !599)
!638 = distinct !DISubprogram(name: "mavlink_finalize_message", scope: !3, file: !3, line: 296, type: !639, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!639 = !DISubroutineType(types: !640)
!640 = !{!44, !376, !12, !12, !12, !12, !12}
!641 = !DILocalVariable(name: "msg", arg: 1, scope: !638, file: !3, line: 296, type: !376)
!642 = !DILocation(line: 296, column: 69, scope: !638)
!643 = !DILocalVariable(name: "system_id", arg: 2, scope: !638, file: !3, line: 296, type: !12)
!644 = !DILocation(line: 296, column: 82, scope: !638)
!645 = !DILocalVariable(name: "component_id", arg: 3, scope: !638, file: !3, line: 296, type: !12)
!646 = !DILocation(line: 296, column: 101, scope: !638)
!647 = !DILocalVariable(name: "min_length", arg: 4, scope: !638, file: !3, line: 297, type: !12)
!648 = !DILocation(line: 297, column: 16, scope: !638)
!649 = !DILocalVariable(name: "length", arg: 5, scope: !638, file: !3, line: 297, type: !12)
!650 = !DILocation(line: 297, column: 36, scope: !638)
!651 = !DILocalVariable(name: "crc_extra", arg: 6, scope: !638, file: !3, line: 297, type: !12)
!652 = !DILocation(line: 297, column: 52, scope: !638)
!653 = !DILocation(line: 299, column: 42, scope: !638)
!654 = !DILocation(line: 299, column: 47, scope: !638)
!655 = !DILocation(line: 299, column: 58, scope: !638)
!656 = !DILocation(line: 299, column: 88, scope: !638)
!657 = !DILocation(line: 299, column: 100, scope: !638)
!658 = !DILocation(line: 299, column: 108, scope: !638)
!659 = !DILocation(line: 299, column: 12, scope: !638)
!660 = !DILocation(line: 299, column: 5, scope: !638)
!661 = distinct !DISubprogram(name: "mavlink_finalize_message_chan", scope: !3, file: !3, line: 286, type: !662, scopeLine: 288, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!662 = !DISubroutineType(types: !663)
!663 = !{!44, !376, !12, !12, !12, !12, !12, !12}
!664 = !DILocalVariable(name: "msg", arg: 1, scope: !661, file: !3, line: 286, type: !376)
!665 = !DILocation(line: 286, column: 74, scope: !661)
!666 = !DILocalVariable(name: "system_id", arg: 2, scope: !661, file: !3, line: 286, type: !12)
!667 = !DILocation(line: 286, column: 87, scope: !661)
!668 = !DILocalVariable(name: "component_id", arg: 3, scope: !661, file: !3, line: 286, type: !12)
!669 = !DILocation(line: 286, column: 106, scope: !661)
!670 = !DILocalVariable(name: "chan", arg: 4, scope: !661, file: !3, line: 287, type: !12)
!671 = !DILocation(line: 287, column: 21, scope: !661)
!672 = !DILocalVariable(name: "min_length", arg: 5, scope: !661, file: !3, line: 287, type: !12)
!673 = !DILocation(line: 287, column: 35, scope: !661)
!674 = !DILocalVariable(name: "length", arg: 6, scope: !661, file: !3, line: 287, type: !12)
!675 = !DILocation(line: 287, column: 55, scope: !661)
!676 = !DILocalVariable(name: "crc_extra", arg: 7, scope: !661, file: !3, line: 287, type: !12)
!677 = !DILocation(line: 287, column: 71, scope: !661)
!678 = !DILocalVariable(name: "status", scope: !661, file: !3, line: 289, type: !6)
!679 = !DILocation(line: 289, column: 20, scope: !661)
!680 = !DILocation(line: 289, column: 56, scope: !661)
!681 = !DILocation(line: 289, column: 29, scope: !661)
!682 = !DILocation(line: 290, column: 41, scope: !661)
!683 = !DILocation(line: 290, column: 46, scope: !661)
!684 = !DILocation(line: 290, column: 57, scope: !661)
!685 = !DILocation(line: 290, column: 71, scope: !661)
!686 = !DILocation(line: 290, column: 79, scope: !661)
!687 = !DILocation(line: 290, column: 91, scope: !661)
!688 = !DILocation(line: 290, column: 99, scope: !661)
!689 = !DILocation(line: 290, column: 9, scope: !661)
!690 = !DILocation(line: 290, column: 2, scope: !661)
!691 = !DILocalVariable(name: "chan", arg: 1, scope: !2, file: !3, line: 23, type: !12)
!692 = !DILocation(line: 23, column: 69, scope: !2)
!693 = !DILocation(line: 31, column: 27, scope: !2)
!694 = !DILocation(line: 31, column: 10, scope: !2)
!695 = !DILocation(line: 31, column: 2, scope: !2)
!696 = distinct !DISubprogram(name: "mavlink_finalize_message_buffer", scope: !3, file: !3, line: 217, type: !697, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!697 = !DISubroutineType(types: !698)
!698 = !{!44, !376, !12, !12, !6, !12, !12, !12}
!699 = !DILocalVariable(name: "msg", arg: 1, scope: !696, file: !3, line: 217, type: !376)
!700 = !DILocation(line: 217, column: 76, scope: !696)
!701 = !DILocalVariable(name: "system_id", arg: 2, scope: !696, file: !3, line: 217, type: !12)
!702 = !DILocation(line: 217, column: 89, scope: !696)
!703 = !DILocalVariable(name: "component_id", arg: 3, scope: !696, file: !3, line: 217, type: !12)
!704 = !DILocation(line: 217, column: 108, scope: !696)
!705 = !DILocalVariable(name: "status", arg: 4, scope: !696, file: !3, line: 218, type: !6)
!706 = !DILocation(line: 218, column: 31, scope: !696)
!707 = !DILocalVariable(name: "min_length", arg: 5, scope: !696, file: !3, line: 218, type: !12)
!708 = !DILocation(line: 218, column: 47, scope: !696)
!709 = !DILocalVariable(name: "length", arg: 6, scope: !696, file: !3, line: 218, type: !12)
!710 = !DILocation(line: 218, column: 67, scope: !696)
!711 = !DILocalVariable(name: "crc_extra", arg: 7, scope: !696, file: !3, line: 218, type: !12)
!712 = !DILocation(line: 218, column: 83, scope: !696)
!713 = !DILocalVariable(name: "mavlink1", scope: !696, file: !3, line: 220, type: !69)
!714 = !DILocation(line: 220, column: 7, scope: !696)
!715 = !DILocation(line: 220, column: 19, scope: !696)
!716 = !DILocation(line: 220, column: 27, scope: !696)
!717 = !DILocation(line: 220, column: 33, scope: !696)
!718 = !DILocation(line: 220, column: 69, scope: !696)
!719 = !DILocalVariable(name: "signing", scope: !696, file: !3, line: 222, type: !69)
!720 = !DILocation(line: 222, column: 7, scope: !696)
!721 = !DILocation(line: 222, column: 20, scope: !696)
!722 = !DILocation(line: 222, column: 30, scope: !696)
!723 = !DILocation(line: 222, column: 33, scope: !696)
!724 = !DILocation(line: 222, column: 41, scope: !696)
!725 = !DILocation(line: 222, column: 49, scope: !696)
!726 = !DILocation(line: 222, column: 53, scope: !696)
!727 = !DILocation(line: 222, column: 61, scope: !696)
!728 = !DILocation(line: 222, column: 70, scope: !696)
!729 = !DILocation(line: 222, column: 76, scope: !696)
!730 = !DILocation(line: 0, scope: !696)
!731 = !DILocalVariable(name: "signature_len", scope: !696, file: !3, line: 226, type: !12)
!732 = !DILocation(line: 226, column: 10, scope: !696)
!733 = !DILocation(line: 226, column: 26, scope: !696)
!734 = !DILocalVariable(name: "header_len", scope: !696, file: !3, line: 227, type: !12)
!735 = !DILocation(line: 227, column: 17, scope: !696)
!736 = !DILocalVariable(name: "buf", scope: !696, file: !3, line: 228, type: !737)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 80, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 10)
!740 = !DILocation(line: 228, column: 10, scope: !696)
!741 = !DILocation(line: 229, column: 6, scope: !742)
!742 = distinct !DILexicalBlock(scope: !696, file: !3, line: 229, column: 6)
!743 = !DILocation(line: 229, column: 6, scope: !696)
!744 = !DILocation(line: 230, column: 3, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !3, line: 229, column: 16)
!746 = !DILocation(line: 230, column: 8, scope: !745)
!747 = !DILocation(line: 230, column: 14, scope: !745)
!748 = !DILocation(line: 231, column: 14, scope: !745)
!749 = !DILocation(line: 232, column: 2, scope: !745)
!750 = !DILocation(line: 233, column: 3, scope: !751)
!751 = distinct !DILexicalBlock(scope: !742, file: !3, line: 232, column: 9)
!752 = !DILocation(line: 233, column: 8, scope: !751)
!753 = !DILocation(line: 233, column: 14, scope: !751)
!754 = !DILocation(line: 235, column: 13, scope: !696)
!755 = !DILocation(line: 235, column: 22, scope: !696)
!756 = !DILocation(line: 235, column: 51, scope: !696)
!757 = !DILocation(line: 235, column: 70, scope: !696)
!758 = !DILocation(line: 235, column: 33, scope: !696)
!759 = !DILocation(line: 235, column: 2, scope: !696)
!760 = !DILocation(line: 235, column: 7, scope: !696)
!761 = !DILocation(line: 235, column: 11, scope: !696)
!762 = !DILocation(line: 236, column: 15, scope: !696)
!763 = !DILocation(line: 236, column: 2, scope: !696)
!764 = !DILocation(line: 236, column: 7, scope: !696)
!765 = !DILocation(line: 236, column: 13, scope: !696)
!766 = !DILocation(line: 237, column: 16, scope: !696)
!767 = !DILocation(line: 237, column: 2, scope: !696)
!768 = !DILocation(line: 237, column: 7, scope: !696)
!769 = !DILocation(line: 237, column: 14, scope: !696)
!770 = !DILocation(line: 238, column: 2, scope: !696)
!771 = !DILocation(line: 238, column: 7, scope: !696)
!772 = !DILocation(line: 238, column: 22, scope: !696)
!773 = !DILocation(line: 239, column: 6, scope: !774)
!774 = distinct !DILexicalBlock(scope: !696, file: !3, line: 239, column: 6)
!775 = !DILocation(line: 239, column: 6, scope: !696)
!776 = !DILocation(line: 240, column: 3, scope: !777)
!777 = distinct !DILexicalBlock(scope: !774, file: !3, line: 239, column: 15)
!778 = !DILocation(line: 240, column: 8, scope: !777)
!779 = !DILocation(line: 240, column: 23, scope: !777)
!780 = !DILocation(line: 241, column: 2, scope: !777)
!781 = !DILocation(line: 242, column: 2, scope: !696)
!782 = !DILocation(line: 242, column: 7, scope: !696)
!783 = !DILocation(line: 242, column: 20, scope: !696)
!784 = !DILocation(line: 243, column: 13, scope: !696)
!785 = !DILocation(line: 243, column: 21, scope: !696)
!786 = !DILocation(line: 243, column: 2, scope: !696)
!787 = !DILocation(line: 243, column: 7, scope: !696)
!788 = !DILocation(line: 243, column: 11, scope: !696)
!789 = !DILocation(line: 244, column: 27, scope: !696)
!790 = !DILocation(line: 244, column: 35, scope: !696)
!791 = !DILocation(line: 244, column: 50, scope: !696)
!792 = !DILocation(line: 244, column: 2, scope: !696)
!793 = !DILocation(line: 244, column: 10, scope: !696)
!794 = !DILocation(line: 244, column: 25, scope: !696)
!795 = !DILocation(line: 247, column: 11, scope: !696)
!796 = !DILocation(line: 247, column: 16, scope: !696)
!797 = !DILocation(line: 247, column: 2, scope: !696)
!798 = !DILocation(line: 247, column: 9, scope: !696)
!799 = !DILocation(line: 248, column: 11, scope: !696)
!800 = !DILocation(line: 248, column: 16, scope: !696)
!801 = !DILocation(line: 248, column: 2, scope: !696)
!802 = !DILocation(line: 248, column: 9, scope: !696)
!803 = !DILocation(line: 249, column: 6, scope: !804)
!804 = distinct !DILexicalBlock(scope: !696, file: !3, line: 249, column: 6)
!805 = !DILocation(line: 249, column: 6, scope: !696)
!806 = !DILocation(line: 250, column: 12, scope: !807)
!807 = distinct !DILexicalBlock(scope: !804, file: !3, line: 249, column: 16)
!808 = !DILocation(line: 250, column: 17, scope: !807)
!809 = !DILocation(line: 250, column: 3, scope: !807)
!810 = !DILocation(line: 250, column: 10, scope: !807)
!811 = !DILocation(line: 251, column: 12, scope: !807)
!812 = !DILocation(line: 251, column: 17, scope: !807)
!813 = !DILocation(line: 251, column: 3, scope: !807)
!814 = !DILocation(line: 251, column: 10, scope: !807)
!815 = !DILocation(line: 252, column: 12, scope: !807)
!816 = !DILocation(line: 252, column: 17, scope: !807)
!817 = !DILocation(line: 252, column: 3, scope: !807)
!818 = !DILocation(line: 252, column: 10, scope: !807)
!819 = !DILocation(line: 253, column: 12, scope: !807)
!820 = !DILocation(line: 253, column: 17, scope: !807)
!821 = !DILocation(line: 253, column: 23, scope: !807)
!822 = !DILocation(line: 253, column: 3, scope: !807)
!823 = !DILocation(line: 253, column: 10, scope: !807)
!824 = !DILocation(line: 254, column: 2, scope: !807)
!825 = !DILocation(line: 255, column: 12, scope: !826)
!826 = distinct !DILexicalBlock(scope: !804, file: !3, line: 254, column: 9)
!827 = !DILocation(line: 255, column: 17, scope: !826)
!828 = !DILocation(line: 255, column: 3, scope: !826)
!829 = !DILocation(line: 255, column: 10, scope: !826)
!830 = !DILocation(line: 256, column: 12, scope: !826)
!831 = !DILocation(line: 256, column: 17, scope: !826)
!832 = !DILocation(line: 256, column: 3, scope: !826)
!833 = !DILocation(line: 256, column: 10, scope: !826)
!834 = !DILocation(line: 257, column: 12, scope: !826)
!835 = !DILocation(line: 257, column: 17, scope: !826)
!836 = !DILocation(line: 257, column: 3, scope: !826)
!837 = !DILocation(line: 257, column: 10, scope: !826)
!838 = !DILocation(line: 258, column: 12, scope: !826)
!839 = !DILocation(line: 258, column: 17, scope: !826)
!840 = !DILocation(line: 258, column: 3, scope: !826)
!841 = !DILocation(line: 258, column: 10, scope: !826)
!842 = !DILocation(line: 259, column: 12, scope: !826)
!843 = !DILocation(line: 259, column: 17, scope: !826)
!844 = !DILocation(line: 259, column: 3, scope: !826)
!845 = !DILocation(line: 259, column: 10, scope: !826)
!846 = !DILocation(line: 260, column: 12, scope: !826)
!847 = !DILocation(line: 260, column: 17, scope: !826)
!848 = !DILocation(line: 260, column: 23, scope: !826)
!849 = !DILocation(line: 260, column: 3, scope: !826)
!850 = !DILocation(line: 260, column: 10, scope: !826)
!851 = !DILocation(line: 261, column: 13, scope: !826)
!852 = !DILocation(line: 261, column: 18, scope: !826)
!853 = !DILocation(line: 261, column: 24, scope: !826)
!854 = !DILocation(line: 261, column: 30, scope: !826)
!855 = !DILocation(line: 261, column: 12, scope: !826)
!856 = !DILocation(line: 261, column: 3, scope: !826)
!857 = !DILocation(line: 261, column: 10, scope: !826)
!858 = !DILocation(line: 262, column: 13, scope: !826)
!859 = !DILocation(line: 262, column: 18, scope: !826)
!860 = !DILocation(line: 262, column: 24, scope: !826)
!861 = !DILocation(line: 262, column: 31, scope: !826)
!862 = !DILocation(line: 262, column: 12, scope: !826)
!863 = !DILocation(line: 262, column: 3, scope: !826)
!864 = !DILocation(line: 262, column: 10, scope: !826)
!865 = !DILocalVariable(name: "checksum", scope: !696, file: !3, line: 265, type: !44)
!866 = !DILocation(line: 265, column: 11, scope: !696)
!867 = !DILocation(line: 265, column: 37, scope: !696)
!868 = !DILocation(line: 265, column: 45, scope: !696)
!869 = !DILocation(line: 265, column: 55, scope: !696)
!870 = !DILocation(line: 265, column: 22, scope: !696)
!871 = !DILocation(line: 266, column: 35, scope: !696)
!872 = !DILocation(line: 266, column: 54, scope: !696)
!873 = !DILocation(line: 266, column: 59, scope: !696)
!874 = !DILocation(line: 266, column: 2, scope: !696)
!875 = !DILocation(line: 267, column: 17, scope: !696)
!876 = !DILocation(line: 267, column: 2, scope: !696)
!877 = !DILocation(line: 268, column: 32, scope: !696)
!878 = !DILocation(line: 268, column: 41, scope: !696)
!879 = !DILocation(line: 268, column: 22, scope: !696)
!880 = !DILocation(line: 268, column: 2, scope: !696)
!881 = !DILocation(line: 268, column: 20, scope: !696)
!882 = !DILocation(line: 269, column: 32, scope: !696)
!883 = !DILocation(line: 269, column: 41, scope: !696)
!884 = !DILocation(line: 269, column: 22, scope: !696)
!885 = !DILocation(line: 269, column: 2, scope: !696)
!886 = !DILocation(line: 269, column: 20, scope: !696)
!887 = !DILocation(line: 271, column: 18, scope: !696)
!888 = !DILocation(line: 271, column: 2, scope: !696)
!889 = !DILocation(line: 271, column: 7, scope: !696)
!890 = !DILocation(line: 271, column: 16, scope: !696)
!891 = !DILocation(line: 274, column: 6, scope: !892)
!892 = distinct !DILexicalBlock(scope: !696, file: !3, line: 274, column: 6)
!893 = !DILocation(line: 274, column: 6, scope: !696)
!894 = !DILocation(line: 275, column: 23, scope: !895)
!895 = distinct !DILexicalBlock(scope: !892, file: !3, line: 274, column: 15)
!896 = !DILocation(line: 275, column: 31, scope: !895)
!897 = !DILocation(line: 276, column: 9, scope: !895)
!898 = !DILocation(line: 276, column: 14, scope: !895)
!899 = !DILocation(line: 277, column: 26, scope: !895)
!900 = !DILocation(line: 277, column: 31, scope: !895)
!901 = !DILocation(line: 278, column: 26, scope: !895)
!902 = !DILocation(line: 278, column: 45, scope: !895)
!903 = !DILocation(line: 278, column: 50, scope: !895)
!904 = !DILocation(line: 279, column: 26, scope: !895)
!905 = !DILocation(line: 279, column: 54, scope: !895)
!906 = !DILocation(line: 279, column: 59, scope: !895)
!907 = !DILocation(line: 279, column: 44, scope: !895)
!908 = !DILocation(line: 279, column: 43, scope: !895)
!909 = !DILocation(line: 275, column: 3, scope: !895)
!910 = !DILocation(line: 280, column: 2, scope: !895)
!911 = !DILocation(line: 283, column: 9, scope: !696)
!912 = !DILocation(line: 283, column: 14, scope: !696)
!913 = !DILocation(line: 283, column: 20, scope: !696)
!914 = !DILocation(line: 283, column: 18, scope: !696)
!915 = !DILocation(line: 283, column: 31, scope: !696)
!916 = !DILocation(line: 283, column: 37, scope: !696)
!917 = !DILocation(line: 283, column: 35, scope: !696)
!918 = !DILocation(line: 283, column: 2, scope: !696)
!919 = distinct !DISubprogram(name: "_mav_trim_payload", scope: !3, file: !3, line: 111, type: !920, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!920 = !DISubroutineType(types: !921)
!921 = !{!12, !254, !12}
!922 = !DILocalVariable(name: "payload", arg: 1, scope: !919, file: !3, line: 111, type: !254)
!923 = !DILocation(line: 111, column: 54, scope: !919)
!924 = !DILocalVariable(name: "length", arg: 2, scope: !919, file: !3, line: 111, type: !12)
!925 = !DILocation(line: 111, column: 71, scope: !919)
!926 = !DILocation(line: 113, column: 2, scope: !919)
!927 = !DILocation(line: 113, column: 9, scope: !919)
!928 = !DILocation(line: 113, column: 16, scope: !919)
!929 = !DILocation(line: 113, column: 20, scope: !919)
!930 = !DILocation(line: 113, column: 23, scope: !919)
!931 = !DILocation(line: 113, column: 31, scope: !919)
!932 = !DILocation(line: 113, column: 37, scope: !919)
!933 = !DILocation(line: 113, column: 41, scope: !919)
!934 = !DILocation(line: 0, scope: !919)
!935 = !DILocation(line: 114, column: 9, scope: !936)
!936 = distinct !DILexicalBlock(scope: !919, file: !3, line: 113, column: 47)
!937 = distinct !{!937, !926, !938}
!938 = !DILocation(line: 115, column: 2, scope: !919)
!939 = !DILocation(line: 116, column: 9, scope: !919)
!940 = !DILocation(line: 116, column: 2, scope: !919)
!941 = distinct !DISubprogram(name: "crc_calculate", scope: !942, file: !942, line: 65, type: !943, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!942 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../checksum.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-client/input/source_code/mavlink")
!943 = !DISubroutineType(types: !944)
!944 = !{!44, !257, !44}
!945 = !DILocalVariable(name: "pBuffer", arg: 1, scope: !941, file: !942, line: 65, type: !257)
!946 = !DILocation(line: 65, column: 53, scope: !941)
!947 = !DILocalVariable(name: "length", arg: 2, scope: !941, file: !942, line: 65, type: !44)
!948 = !DILocation(line: 65, column: 71, scope: !941)
!949 = !DILocalVariable(name: "crcTmp", scope: !941, file: !942, line: 67, type: !44)
!950 = !DILocation(line: 67, column: 18, scope: !941)
!951 = !DILocation(line: 68, column: 9, scope: !941)
!952 = !DILocation(line: 69, column: 2, scope: !941)
!953 = !DILocation(line: 69, column: 15, scope: !941)
!954 = !DILocation(line: 70, column: 40, scope: !955)
!955 = distinct !DILexicalBlock(scope: !941, file: !942, line: 69, column: 19)
!956 = !DILocation(line: 70, column: 32, scope: !955)
!957 = !DILocation(line: 70, column: 17, scope: !955)
!958 = distinct !{!958, !952, !959}
!959 = !DILocation(line: 71, column: 9, scope: !941)
!960 = !DILocation(line: 72, column: 16, scope: !941)
!961 = !DILocation(line: 72, column: 9, scope: !941)
!962 = distinct !DISubprogram(name: "crc_accumulate_buffer", scope: !942, file: !942, line: 85, type: !963, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !965, !254, !44}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!966 = !DILocalVariable(name: "crcAccum", arg: 1, scope: !962, file: !942, line: 85, type: !965)
!967 = !DILocation(line: 85, column: 52, scope: !962)
!968 = !DILocalVariable(name: "pBuffer", arg: 2, scope: !962, file: !942, line: 85, type: !254)
!969 = !DILocation(line: 85, column: 74, scope: !962)
!970 = !DILocalVariable(name: "length", arg: 3, scope: !962, file: !942, line: 85, type: !44)
!971 = !DILocation(line: 85, column: 92, scope: !962)
!972 = !DILocalVariable(name: "p", scope: !962, file: !942, line: 87, type: !257)
!973 = !DILocation(line: 87, column: 17, scope: !962)
!974 = !DILocation(line: 87, column: 38, scope: !962)
!975 = !DILocation(line: 88, column: 2, scope: !962)
!976 = !DILocation(line: 88, column: 15, scope: !962)
!977 = !DILocation(line: 89, column: 34, scope: !978)
!978 = distinct !DILexicalBlock(scope: !962, file: !942, line: 88, column: 19)
!979 = !DILocation(line: 89, column: 32, scope: !978)
!980 = !DILocation(line: 89, column: 38, scope: !978)
!981 = !DILocation(line: 89, column: 17, scope: !978)
!982 = distinct !{!982, !975, !983}
!983 = !DILocation(line: 90, column: 9, scope: !962)
!984 = !DILocation(line: 91, column: 1, scope: !962)
!985 = distinct !DISubprogram(name: "crc_accumulate", scope: !942, file: !942, line: 35, type: !986, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !12, !965}
!988 = !DILocalVariable(name: "data", arg: 1, scope: !985, file: !942, line: 35, type: !12)
!989 = !DILocation(line: 35, column: 43, scope: !985)
!990 = !DILocalVariable(name: "crcAccum", arg: 2, scope: !985, file: !942, line: 35, type: !965)
!991 = !DILocation(line: 35, column: 59, scope: !985)
!992 = !DILocalVariable(name: "tmp", scope: !985, file: !942, line: 38, type: !12)
!993 = !DILocation(line: 38, column: 17, scope: !985)
!994 = !DILocation(line: 40, column: 15, scope: !985)
!995 = !DILocation(line: 40, column: 33, scope: !985)
!996 = !DILocation(line: 40, column: 32, scope: !985)
!997 = !DILocation(line: 40, column: 42, scope: !985)
!998 = !DILocation(line: 40, column: 22, scope: !985)
!999 = !DILocation(line: 40, column: 20, scope: !985)
!1000 = !DILocation(line: 40, column: 13, scope: !985)
!1001 = !DILocation(line: 41, column: 17, scope: !985)
!1002 = !DILocation(line: 41, column: 20, scope: !985)
!1003 = !DILocation(line: 41, column: 13, scope: !985)
!1004 = !DILocation(line: 42, column: 23, scope: !985)
!1005 = !DILocation(line: 42, column: 22, scope: !985)
!1006 = !DILocation(line: 42, column: 31, scope: !985)
!1007 = !DILocation(line: 42, column: 39, scope: !985)
!1008 = !DILocation(line: 42, column: 42, scope: !985)
!1009 = !DILocation(line: 42, column: 36, scope: !985)
!1010 = !DILocation(line: 42, column: 50, scope: !985)
!1011 = !DILocation(line: 42, column: 54, scope: !985)
!1012 = !DILocation(line: 42, column: 47, scope: !985)
!1013 = !DILocation(line: 42, column: 62, scope: !985)
!1014 = !DILocation(line: 42, column: 65, scope: !985)
!1015 = !DILocation(line: 42, column: 59, scope: !985)
!1016 = !DILocation(line: 42, column: 21, scope: !985)
!1017 = !DILocation(line: 42, column: 10, scope: !985)
!1018 = !DILocation(line: 42, column: 19, scope: !985)
!1019 = !DILocation(line: 43, column: 1, scope: !985)
!1020 = distinct !DISubprogram(name: "mavlink_sign_packet", scope: !3, file: !3, line: 73, type: !1021, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!12, !1023, !256, !257, !12, !257, !12, !257}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_signing_t", file: !8, line: 254, baseType: !52)
!1025 = !DILocalVariable(name: "signing", arg: 1, scope: !1020, file: !3, line: 73, type: !1023)
!1026 = !DILocation(line: 73, column: 63, scope: !1020)
!1027 = !DILocalVariable(name: "signature", arg: 2, scope: !1020, file: !3, line: 74, type: !256)
!1028 = !DILocation(line: 74, column: 17, scope: !1020)
!1029 = !DILocalVariable(name: "header", arg: 3, scope: !1020, file: !3, line: 75, type: !257)
!1030 = !DILocation(line: 75, column: 24, scope: !1020)
!1031 = !DILocalVariable(name: "header_len", arg: 4, scope: !1020, file: !3, line: 75, type: !12)
!1032 = !DILocation(line: 75, column: 40, scope: !1020)
!1033 = !DILocalVariable(name: "packet", arg: 5, scope: !1020, file: !3, line: 76, type: !257)
!1034 = !DILocation(line: 76, column: 24, scope: !1020)
!1035 = !DILocalVariable(name: "packet_len", arg: 6, scope: !1020, file: !3, line: 76, type: !12)
!1036 = !DILocation(line: 76, column: 40, scope: !1020)
!1037 = !DILocalVariable(name: "crc", arg: 7, scope: !1020, file: !3, line: 77, type: !257)
!1038 = !DILocation(line: 77, column: 23, scope: !1020)
!1039 = !DILocalVariable(name: "ctx", scope: !1020, file: !3, line: 79, type: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_sha256_ctx", file: !265, line: 60, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 53, size: 832, elements: !1042)
!1042 = !{!1043, !1045, !1047}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !1041, file: !265, line: 54, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !318)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1041, file: !265, line: 55, baseType: !1046, size: 256, offset: 64)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !293)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1041, file: !265, line: 59, baseType: !1048, size: 512, offset: 320)
!1048 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1041, file: !265, line: 56, size: 512, elements: !1049)
!1049 = !{!1050, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "save_bytes", scope: !1048, file: !265, line: 57, baseType: !1051, size: 512)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !268)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "save_u32", scope: !1048, file: !265, line: 58, baseType: !1053, size: 512)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 512, elements: !90)
!1054 = !DILocation(line: 79, column: 21, scope: !1020)
!1055 = !DILocalVariable(name: "tstamp", scope: !1020, file: !3, line: 83, type: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !3, line: 80, size: 64, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "t64", scope: !1056, file: !3, line: 81, baseType: !57, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "t8", scope: !1056, file: !3, line: 82, baseType: !1060, size: 64)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !293)
!1061 = !DILocation(line: 83, column: 4, scope: !1020)
!1062 = !DILocation(line: 84, column: 6, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 84, column: 6)
!1064 = !DILocation(line: 84, column: 14, scope: !1063)
!1065 = !DILocation(line: 84, column: 22, scope: !1063)
!1066 = !DILocation(line: 84, column: 27, scope: !1063)
!1067 = !DILocation(line: 84, column: 36, scope: !1063)
!1068 = !DILocation(line: 84, column: 42, scope: !1063)
!1069 = !DILocation(line: 84, column: 6, scope: !1020)
!1070 = !DILocation(line: 85, column: 6, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 84, column: 81)
!1072 = !DILocation(line: 87, column: 17, scope: !1020)
!1073 = !DILocation(line: 87, column: 26, scope: !1020)
!1074 = !DILocation(line: 87, column: 2, scope: !1020)
!1075 = !DILocation(line: 87, column: 15, scope: !1020)
!1076 = !DILocation(line: 88, column: 15, scope: !1020)
!1077 = !DILocation(line: 88, column: 24, scope: !1020)
!1078 = !DILocation(line: 88, column: 9, scope: !1020)
!1079 = !DILocation(line: 88, column: 13, scope: !1020)
!1080 = !DILocation(line: 89, column: 10, scope: !1020)
!1081 = !DILocation(line: 89, column: 31, scope: !1020)
!1082 = !DILocation(line: 89, column: 2, scope: !1020)
!1083 = !DILocation(line: 90, column: 2, scope: !1020)
!1084 = !DILocation(line: 90, column: 11, scope: !1020)
!1085 = !DILocation(line: 90, column: 20, scope: !1020)
!1086 = !DILocation(line: 92, column: 2, scope: !1020)
!1087 = !DILocation(line: 93, column: 30, scope: !1020)
!1088 = !DILocation(line: 93, column: 39, scope: !1020)
!1089 = !DILocation(line: 93, column: 2, scope: !1020)
!1090 = !DILocation(line: 94, column: 30, scope: !1020)
!1091 = !DILocation(line: 94, column: 38, scope: !1020)
!1092 = !DILocation(line: 94, column: 2, scope: !1020)
!1093 = !DILocation(line: 95, column: 30, scope: !1020)
!1094 = !DILocation(line: 95, column: 38, scope: !1020)
!1095 = !DILocation(line: 95, column: 2, scope: !1020)
!1096 = !DILocation(line: 96, column: 30, scope: !1020)
!1097 = !DILocation(line: 96, column: 2, scope: !1020)
!1098 = !DILocation(line: 97, column: 30, scope: !1020)
!1099 = !DILocation(line: 97, column: 2, scope: !1020)
!1100 = !DILocation(line: 98, column: 33, scope: !1020)
!1101 = !DILocation(line: 98, column: 2, scope: !1020)
!1102 = !DILocation(line: 100, column: 2, scope: !1020)
!1103 = !DILocation(line: 101, column: 1, scope: !1020)
!1104 = distinct !DISubprogram(name: "crc_init", scope: !942, file: !942, line: 52, type: !1105, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !92, retainedNodes: !270)
!1105 = !DISubroutineType(types: !1106)
