; ModuleID = 'mavlink_server.c'
source_filename = "mavlink_server.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__mavlink_msg_entry = type { i32, i8, i8, i8, i8, i8, i8 }
%struct.__mavlink_message = type <{ i16, i8, i8, i8, i8, i8, i8, i8, [3 x i8], [33 x i64], [2 x i8], [13 x i8] }>
%struct.__mavlink_status = type { i8, i8, i8, i32, i8, i8, i8, i16, i16, i8, i8, %struct.__mavlink_signing*, %struct.__mavlink_signing_streams* }
%struct.__mavlink_signing = type { i8, i8, i64, [32 x i8], i1 (%struct.__mavlink_status*, i32)* }
%struct.__mavlink_signing_streams = type { i16, [16 x %struct.__mavlink_signing_stream] }
%struct.__mavlink_signing_stream = type { i8, i8, i8, [6 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.__mavlink_heartbeat_t = type { i32, i8, i8, i8, i8, i8 }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.mavlink_sha256_ctx = type { [2 x i32], [8 x i32], %union.anon }
%union.anon = type { [16 x i32] }
%union.tstamp = type { i64 }

@.str = private unnamed_addr constant [83 x i8] c"Received heartbeat: sysid=%d, compid=%d, type=%d, autopilot=%d, mode=%d, state=%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [21 x i8] c"Error receiving data\00", align 1
@.str.2 = private unnamed_addr constant [22 x i8] c"Error creating socket\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mavlink_message_crcs", scope: !2, file: !3, line: 512, type: !229, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "mavlink_get_msg_entry", scope: !3, file: !3, line: 510, type: !4, scopeLine: 511, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!3 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../mavlink_helpers.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-server/input/source_code/mavlink")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_msg_entry_t", file: !9, line: 291, baseType: !10)
!9 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../mavlink_types.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-server/input/source_code/mavlink")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_msg_entry", file: !9, line: 283, size: 96, elements: !11)
!11 = !{!12, !18, !22, !23, !24, !25, !26}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "msgid", scope: !10, file: !9, line: 284, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !14, line: 26, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !16, line: 42, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "crc_extra", scope: !10, file: !9, line: 285, baseType: !19, size: 8, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !14, line: 24, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !16, line: 38, baseType: !21)
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "min_msg_len", scope: !10, file: !9, line: 286, baseType: !19, size: 8, offset: 40)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "max_msg_len", scope: !10, file: !9, line: 287, baseType: !19, size: 8, offset: 48)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !10, file: !9, line: 288, baseType: !19, size: 8, offset: 56)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "target_system_ofs", scope: !10, file: !9, line: 289, baseType: !19, size: 8, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "target_component_ofs", scope: !10, file: !9, line: 290, baseType: !19, size: 8, offset: 72)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !125, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "mavlink_server.c", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-server/input/source_code/mavlink")
!29 = !{!30, !48, !54, !66, !95}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 186, baseType: !17, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!32 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_UNINIT", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_IDLE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_STX", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_LENGTH", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_INCOMPAT_FLAGS", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_COMPAT_FLAGS", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_SEQ", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_SYSID", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_COMPID", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_MSGID1", value: 9, isUnsigned: true)
!42 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_MSGID2", value: 10, isUnsigned: true)
!43 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_MSGID3", value: 11, isUnsigned: true)
!44 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_PAYLOAD", value: 12, isUnsigned: true)
!45 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_CRC1", value: 13, isUnsigned: true)
!46 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_GOT_BAD_CRC1", value: 14, isUnsigned: true)
!47 = !DIEnumerator(name: "MAVLINK_PARSE_STATE_SIGNATURE_WAIT", value: 15, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 165, baseType: !17, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "MAVLINK_COMM_0", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "MAVLINK_COMM_1", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "MAVLINK_COMM_2", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "MAVLINK_COMM_3", value: 3, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !55, line: 24, baseType: !17, size: 32, elements: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65}
!57 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!63 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!64 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!65 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 40, baseType: !17, size: 32, elements: !68)
!67 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!69 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!74 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!75 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!76 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!77 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!78 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!79 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!80 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!81 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!82 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!83 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!84 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!85 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!86 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!87 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!88 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!89 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!90 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!91 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!92 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!93 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!94 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 205, baseType: !17, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIEnumerator(name: "MAVLINK_FRAMING_INCOMPLETE", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "MAVLINK_FRAMING_OK", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "MAVLINK_FRAMING_BAD_CRC", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "MAVLINK_FRAMING_BAD_SIGNATURE", value: 3, isUnsigned: true)
!101 = !{!102, !115, !13, !112, !116, !117, !19, !118, !120, !122, !124}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !104, line: 178, size: 128, elements: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!105 = !{!106, !110}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !103, file: !104, line: 180, baseType: !107, size: 16)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !108, line: 28, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!109 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !103, file: !104, line: 181, baseType: !111, size: 112, offset: 16)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 112, elements: !113)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!113 = !{!114}
!114 = !DISubrange(count: 14)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !67, line: 30, baseType: !13)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!125 = !{!0, !126, !133, !172}
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "mavlink_sha256_constant_256", scope: !27, file: !128, line: 72, type: !129, isLocal: true, isDefinition: true)
!128 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../mavlink_sha256.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-server/input/source_code/mavlink")
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 2048, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!131 = !{!132}
!132 = !DISubrange(count: 64)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "m_mavlink_buffer", scope: !135, file: !3, line: 46, type: !169, isLocal: true, isDefinition: true)
!135 = distinct !DISubprogram(name: "mavlink_get_channel_buffer", scope: !3, file: !3, line: 39, type: !136, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !19}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_message_t", file: !9, line: 121, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_message", file: !9, line: 107, size: 2328, elements: !141)
!141 = !{!142, !145, !146, !147, !148, !149, !150, !151, !152, !153, !160, !164}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !140, file: !9, line: 107, baseType: !143, size: 16)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !14, line: 25, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !16, line: 40, baseType: !109)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !140, file: !9, line: 107, baseType: !19, size: 8, offset: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !9, line: 107, baseType: !19, size: 8, offset: 24)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "incompat_flags", scope: !140, file: !9, line: 107, baseType: !19, size: 8, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "compat_flags", scope: !140, file: !9, line: 107, baseType: !19, size: 8, offset: 40)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !140, file: !9, line: 107, baseType: !19, size: 8, offset: 48)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sysid", scope: !140, file: !9, line: 107, baseType: !19, size: 8, offset: 56)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "compid", scope: !140, file: !9, line: 107, baseType: !19, size: 8, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "msgid", scope: !140, file: !9, line: 107, baseType: !13, size: 24, offset: 72, flags: DIFlagBitField, extraData: i64 72)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "payload64", scope: !140, file: !9, line: 107, baseType: !154, size: 2112, offset: 96)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 2112, elements: !158)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !14, line: 27, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !16, line: 45, baseType: !157)
!157 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!158 = !{!159}
!159 = !DISubrange(count: 33)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ck", scope: !140, file: !9, line: 107, baseType: !161, size: 16, offset: 2208)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 16, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !140, file: !9, line: 107, baseType: !165, size: 104, offset: 2224)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 104, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 13)
!168 = !{}
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 37248, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 16)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "m_mavlink_status", scope: !174, file: !3, line: 29, type: !228, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "mavlink_get_channel_status", scope: !3, file: !3, line: 23, type: !175, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !19}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_status_t", file: !9, line: 233, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_status", file: !9, line: 219, size: 320, elements: !180)
!180 = !{!181, !182, !183, !184, !186, !187, !188, !189, !190, !191, !192, !193, !212}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "msg_received", scope: !179, file: !9, line: 220, baseType: !19, size: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_overrun", scope: !179, file: !9, line: 221, baseType: !19, size: 8, offset: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parse_error", scope: !179, file: !9, line: 222, baseType: !19, size: 8, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "parse_state", scope: !179, file: !9, line: 223, baseType: !185, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_parse_state_t", file: !9, line: 203, baseType: !30)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "packet_idx", scope: !179, file: !9, line: 224, baseType: !19, size: 8, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "current_rx_seq", scope: !179, file: !9, line: 225, baseType: !19, size: 8, offset: 72)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "current_tx_seq", scope: !179, file: !9, line: 226, baseType: !19, size: 8, offset: 80)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "packet_rx_success_count", scope: !179, file: !9, line: 227, baseType: !143, size: 16, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "packet_rx_drop_count", scope: !179, file: !9, line: 228, baseType: !143, size: 16, offset: 112)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !9, line: 229, baseType: !19, size: 8, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "signature_wait", scope: !179, file: !9, line: 230, baseType: !19, size: 8, offset: 136)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "signing", scope: !179, file: !9, line: 231, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_signing", file: !9, line: 248, size: 448, elements: !196)
!196 = !{!197, !198, !199, !200, !204}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !9, line: 249, baseType: !19, size: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "link_id", scope: !195, file: !9, line: 250, baseType: !19, size: 8, offset: 8)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !195, file: !9, line: 251, baseType: !155, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "secret_key", scope: !195, file: !9, line: 252, baseType: !201, size: 256, offset: 128)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "accept_unsigned_callback", scope: !195, file: !9, line: 253, baseType: !205, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_accept_unsigned_t", file: !9, line: 238, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !210, !13}
!209 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "signing_streams", scope: !179, file: !9, line: 232, baseType: !213, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_signing_streams", file: !9, line: 263, size: 1168, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_signing_streams", scope: !214, file: !9, line: 264, baseType: !143, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !214, file: !9, line: 270, baseType: !218, size: 1152, offset: 16)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 1152, elements: !170)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_signing_stream", file: !9, line: 265, size: 72, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "link_id", scope: !219, file: !9, line: 266, baseType: !19, size: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sysid", scope: !219, file: !9, line: 267, baseType: !19, size: 8, offset: 8)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "compid", scope: !219, file: !9, line: 268, baseType: !19, size: 8, offset: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_bytes", scope: !219, file: !9, line: 269, baseType: !225, size: 48, offset: 24)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 48, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 6)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 5120, elements: !170)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 18816, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 196)
!232 = !{i32 7, !"Dwarf Version", i32 4}
!233 = !{i32 2, !"Debug Info Version", i32 3}
!234 = !{i32 1, !"wchar_size", i32 4}
!235 = !{!"clang version 10.0.0-4ubuntu1 "}
!236 = distinct !DISubprogram(name: "receive_heartbeat", scope: !28, file: !28, line: 18, type: !237, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !27, retainedNodes: !168)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !239}
!239 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!240 = !DILocalVariable(name: "sock", arg: 1, scope: !236, file: !28, line: 18, type: !239)
!241 = !DILocation(line: 18, column: 28, scope: !236)
!242 = !DILocalVariable(name: "buf", scope: !236, file: !28, line: 19, type: !243)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 16328, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 2041)
!246 = !DILocation(line: 19, column: 13, scope: !236)
!247 = !DILocalVariable(name: "src_addr", scope: !236, file: !28, line: 20, type: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !67, line: 238, size: 128, elements: !249)
!249 = !{!250, !251, !253, !257}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !248, file: !67, line: 240, baseType: !107, size: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !248, file: !67, line: 241, baseType: !252, size: 16, offset: 16)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !67, line: 119, baseType: !143)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !248, file: !67, line: 242, baseType: !254, size: 32, offset: 32)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !67, line: 31, size: 32, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !254, file: !67, line: 33, baseType: !115, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !248, file: !67, line: 245, baseType: !258, size: 64, offset: 64)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 8)
!261 = !DILocation(line: 20, column: 24, scope: !236)
!262 = !DILocalVariable(name: "addrlen", scope: !236, file: !28, line: 21, type: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !264, line: 274, baseType: !265)
!264 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !16, line: 209, baseType: !17)
!266 = !DILocation(line: 21, column: 15, scope: !236)
!267 = !DILocalVariable(name: "recsize", scope: !236, file: !28, line: 22, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !269, line: 77, baseType: !270)
!269 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 193, baseType: !271)
!271 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!272 = !DILocation(line: 22, column: 13, scope: !236)
!273 = !DILocation(line: 24, column: 24, scope: !236)
!274 = !DILocation(line: 24, column: 30, scope: !236)
!275 = !DILocation(line: 24, column: 53, scope: !236)
!276 = !DILocation(line: 24, column: 15, scope: !236)
!277 = !DILocation(line: 24, column: 13, scope: !236)
!278 = !DILocalVariable(name: "len", scope: !236, file: !28, line: 25, type: !239)
!279 = !DILocation(line: 25, column: 9, scope: !236)
!280 = !DILocation(line: 25, column: 14, scope: !236)
!281 = !DILocation(line: 25, column: 21, scope: !236)
!282 = !DILocation(line: 27, column: 9, scope: !283)
!283 = distinct !DILexicalBlock(scope: !236, file: !28, line: 27, column: 9)
!284 = !DILocation(line: 27, column: 17, scope: !283)
!285 = !DILocation(line: 27, column: 9, scope: !236)
!286 = !DILocalVariable(name: "msg", scope: !287, file: !28, line: 28, type: !139)
!287 = distinct !DILexicalBlock(scope: !283, file: !28, line: 27, column: 22)
!288 = !DILocation(line: 28, column: 27, scope: !287)
!289 = !DILocalVariable(name: "status", scope: !287, file: !28, line: 29, type: !178)
!290 = !DILocation(line: 29, column: 26, scope: !287)
!291 = !DILocalVariable(name: "i", scope: !292, file: !28, line: 32, type: !239)
!292 = distinct !DILexicalBlock(scope: !287, file: !28, line: 32, column: 9)
!293 = !DILocation(line: 32, column: 18, scope: !292)
!294 = !DILocation(line: 32, column: 14, scope: !292)
!295 = !DILocation(line: 32, column: 25, scope: !296)
!296 = distinct !DILexicalBlock(scope: !292, file: !28, line: 32, column: 9)
!297 = !DILocation(line: 32, column: 29, scope: !296)
!298 = !DILocation(line: 32, column: 27, scope: !296)
!299 = !DILocation(line: 32, column: 9, scope: !292)
!300 = !DILocation(line: 33, column: 56, scope: !301)
!301 = distinct !DILexicalBlock(scope: !302, file: !28, line: 33, column: 17)
!302 = distinct !DILexicalBlock(scope: !296, file: !28, line: 32, column: 43)
!303 = !DILocation(line: 33, column: 52, scope: !301)
!304 = !DILocation(line: 33, column: 17, scope: !301)
!305 = !DILocation(line: 33, column: 17, scope: !302)
!306 = !DILocation(line: 35, column: 25, scope: !307)
!307 = distinct !DILexicalBlock(scope: !308, file: !28, line: 35, column: 21)
!308 = distinct !DILexicalBlock(scope: !301, file: !28, line: 33, column: 76)
!309 = !DILocation(line: 35, column: 31, scope: !307)
!310 = !DILocation(line: 35, column: 21, scope: !308)
!311 = !DILocalVariable(name: "heartbeat", scope: !312, file: !28, line: 36, type: !313)
!312 = distinct !DILexicalBlock(scope: !307, file: !28, line: 35, column: 60)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_heartbeat_t", file: !314, line: 16, baseType: !315)
!314 = !DIFile(filename: "generated/include/mavlink/v2.0/common/../minimal/./mavlink_msg_heartbeat.h", directory: "/home/raoxue/Desktop/IF-driver-partition/FIPA/examples/mavlink-server/input/source_code/mavlink")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__mavlink_heartbeat_t", file: !314, line: 9, size: 96, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "custom_mode", scope: !315, file: !314, line: 10, baseType: !13, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !314, line: 11, baseType: !19, size: 8, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "autopilot", scope: !315, file: !314, line: 12, baseType: !19, size: 8, offset: 40)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "base_mode", scope: !315, file: !314, line: 13, baseType: !19, size: 8, offset: 48)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "system_status", scope: !315, file: !314, line: 14, baseType: !19, size: 8, offset: 56)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mavlink_version", scope: !315, file: !314, line: 15, baseType: !19, size: 8, offset: 64)
!323 = !DILocation(line: 36, column: 41, scope: !312)
!324 = !DILocation(line: 37, column: 21, scope: !312)
!325 = !DILocation(line: 39, column: 32, scope: !312)
!326 = !DILocation(line: 39, column: 28, scope: !312)
!327 = !DILocation(line: 39, column: 43, scope: !312)
!328 = !DILocation(line: 39, column: 39, scope: !312)
!329 = !DILocation(line: 39, column: 61, scope: !312)
!330 = !DILocation(line: 39, column: 51, scope: !312)
!331 = !DILocation(line: 39, column: 77, scope: !312)
!332 = !DILocation(line: 39, column: 67, scope: !312)
!333 = !DILocation(line: 39, column: 98, scope: !312)
!334 = !DILocation(line: 39, column: 88, scope: !312)
!335 = !DILocation(line: 39, column: 119, scope: !312)
!336 = !DILocation(line: 39, column: 109, scope: !312)
!337 = !DILocation(line: 38, column: 21, scope: !312)
!338 = !DILocation(line: 40, column: 17, scope: !312)
!339 = !DILocation(line: 41, column: 13, scope: !308)
!340 = !DILocation(line: 42, column: 9, scope: !302)
!341 = !DILocation(line: 32, column: 39, scope: !296)
!342 = !DILocation(line: 32, column: 9, scope: !296)
!343 = distinct !{!343, !299, !344}
!344 = !DILocation(line: 42, column: 9, scope: !292)
!345 = !DILocation(line: 43, column: 5, scope: !287)
!346 = !DILocation(line: 43, column: 16, scope: !347)
!347 = distinct !DILexicalBlock(scope: !283, file: !28, line: 43, column: 16)
!348 = !DILocation(line: 43, column: 24, scope: !347)
!349 = !DILocation(line: 43, column: 28, scope: !347)
!350 = !DILocation(line: 43, column: 31, scope: !347)
!351 = !DILocation(line: 43, column: 37, scope: !347)
!352 = !DILocation(line: 43, column: 47, scope: !347)
!353 = !DILocation(line: 43, column: 50, scope: !347)
!354 = !DILocation(line: 43, column: 56, scope: !347)
!355 = !DILocation(line: 43, column: 16, scope: !283)
!356 = !DILocation(line: 44, column: 9, scope: !357)
!357 = distinct !DILexicalBlock(scope: !347, file: !28, line: 43, column: 72)
!358 = !DILocation(line: 45, column: 5, scope: !357)
!359 = !DILocation(line: 46, column: 1, scope: !236)
!360 = distinct !DISubprogram(name: "mavlink_parse_char", scope: !3, file: !3, line: 984, type: !361, scopeLine: 985, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!361 = !DISubroutineType(types: !362)
!362 = !{!19, !19, !19, !138, !177}
!363 = !DILocalVariable(name: "chan", arg: 1, scope: !360, file: !3, line: 984, type: !19)
!364 = !DILocation(line: 984, column: 51, scope: !360)
!365 = !DILocalVariable(name: "c", arg: 2, scope: !360, file: !3, line: 984, type: !19)
!366 = !DILocation(line: 984, column: 65, scope: !360)
!367 = !DILocalVariable(name: "r_message", arg: 3, scope: !360, file: !3, line: 984, type: !138)
!368 = !DILocation(line: 984, column: 87, scope: !360)
!369 = !DILocalVariable(name: "r_mavlink_status", arg: 4, scope: !360, file: !3, line: 984, type: !177)
!370 = !DILocation(line: 984, column: 116, scope: !360)
!371 = !DILocalVariable(name: "msg_received", scope: !360, file: !3, line: 986, type: !19)
!372 = !DILocation(line: 986, column: 13, scope: !360)
!373 = !DILocation(line: 986, column: 47, scope: !360)
!374 = !DILocation(line: 986, column: 53, scope: !360)
!375 = !DILocation(line: 986, column: 56, scope: !360)
!376 = !DILocation(line: 986, column: 67, scope: !360)
!377 = !DILocation(line: 986, column: 28, scope: !360)
!378 = !DILocation(line: 987, column: 9, scope: !379)
!379 = distinct !DILexicalBlock(scope: !360, file: !3, line: 987, column: 9)
!380 = !DILocation(line: 987, column: 22, scope: !379)
!381 = !DILocation(line: 987, column: 49, scope: !379)
!382 = !DILocation(line: 988, column: 2, scope: !379)
!383 = !DILocation(line: 988, column: 15, scope: !379)
!384 = !DILocation(line: 987, column: 9, scope: !360)
!385 = !DILocalVariable(name: "rxmsg", scope: !386, file: !3, line: 990, type: !138)
!386 = distinct !DILexicalBlock(scope: !379, file: !3, line: 988, column: 49)
!387 = !DILocation(line: 990, column: 25, scope: !386)
!388 = !DILocation(line: 990, column: 60, scope: !386)
!389 = !DILocation(line: 990, column: 33, scope: !386)
!390 = !DILocalVariable(name: "status", scope: !386, file: !3, line: 991, type: !177)
!391 = !DILocation(line: 991, column: 24, scope: !386)
!392 = !DILocation(line: 991, column: 60, scope: !386)
!393 = !DILocation(line: 991, column: 33, scope: !386)
!394 = !DILocation(line: 992, column: 23, scope: !386)
!395 = !DILocation(line: 992, column: 6, scope: !386)
!396 = !DILocation(line: 993, column: 6, scope: !386)
!397 = !DILocation(line: 993, column: 14, scope: !386)
!398 = !DILocation(line: 993, column: 27, scope: !386)
!399 = !DILocation(line: 994, column: 6, scope: !386)
!400 = !DILocation(line: 994, column: 14, scope: !386)
!401 = !DILocation(line: 994, column: 26, scope: !386)
!402 = !DILocation(line: 995, column: 10, scope: !403)
!403 = distinct !DILexicalBlock(scope: !386, file: !3, line: 995, column: 10)
!404 = !DILocation(line: 995, column: 12, scope: !403)
!405 = !DILocation(line: 995, column: 10, scope: !386)
!406 = !DILocation(line: 997, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !403, file: !3, line: 996, column: 6)
!408 = !DILocation(line: 997, column: 15, scope: !407)
!409 = !DILocation(line: 997, column: 27, scope: !407)
!410 = !DILocation(line: 998, column: 7, scope: !407)
!411 = !DILocation(line: 998, column: 14, scope: !407)
!412 = !DILocation(line: 998, column: 18, scope: !407)
!413 = !DILocation(line: 999, column: 30, scope: !407)
!414 = !DILocation(line: 999, column: 7, scope: !407)
!415 = !DILocation(line: 1000, column: 6, scope: !407)
!416 = !DILocation(line: 1001, column: 6, scope: !386)
!417 = !DILocation(line: 1003, column: 12, scope: !360)
!418 = !DILocation(line: 1003, column: 5, scope: !360)
!419 = !DILocation(line: 1004, column: 1, scope: !360)
!420 = distinct !DISubprogram(name: "mavlink_msg_heartbeat_decode", scope: !314, file: !314, line: 332, type: !421, scopeLine: 333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !423, !425}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!426 = !DILocalVariable(name: "msg", arg: 1, scope: !420, file: !314, line: 332, type: !423)
!427 = !DILocation(line: 332, column: 74, scope: !420)
!428 = !DILocalVariable(name: "heartbeat", arg: 2, scope: !420, file: !314, line: 332, type: !425)
!429 = !DILocation(line: 332, column: 100, scope: !420)
!430 = !DILocalVariable(name: "len", scope: !420, file: !314, line: 342, type: !19)
!431 = !DILocation(line: 342, column: 17, scope: !420)
!432 = !DILocation(line: 342, column: 23, scope: !420)
!433 = !DILocation(line: 342, column: 28, scope: !420)
!434 = !DILocation(line: 342, column: 32, scope: !420)
!435 = !DILocation(line: 342, column: 64, scope: !420)
!436 = !DILocation(line: 342, column: 69, scope: !420)
!437 = !DILocation(line: 343, column: 16, scope: !420)
!438 = !DILocation(line: 343, column: 9, scope: !420)
!439 = !DILocation(line: 344, column: 12, scope: !420)
!440 = !DILocation(line: 344, column: 5, scope: !420)
!441 = !DILocation(line: 344, column: 23, scope: !420)
!442 = !DILocation(line: 344, column: 42, scope: !420)
!443 = !DILocation(line: 346, column: 1, scope: !420)
!444 = distinct !DISubprogram(name: "main", scope: !28, file: !28, line: 48, type: !445, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !27, retainedNodes: !168)
!445 = !DISubroutineType(types: !446)
!446 = !{!239}
!447 = !DILocalVariable(name: "sock", scope: !444, file: !28, line: 50, type: !239)
!448 = !DILocation(line: 50, column: 9, scope: !444)
!449 = !DILocation(line: 50, column: 16, scope: !444)
!450 = !DILocation(line: 51, column: 9, scope: !451)
!451 = distinct !DILexicalBlock(scope: !444, file: !28, line: 51, column: 9)
!452 = !DILocation(line: 51, column: 14, scope: !451)
!453 = !DILocation(line: 51, column: 9, scope: !444)
!454 = !DILocation(line: 52, column: 9, scope: !455)
!455 = distinct !DILexicalBlock(scope: !451, file: !28, line: 51, column: 19)
!456 = !DILocation(line: 53, column: 9, scope: !455)
!457 = !DILocalVariable(name: "flags", scope: !444, file: !28, line: 57, type: !239)
!458 = !DILocation(line: 57, column: 9, scope: !444)
!459 = !DILocation(line: 57, column: 23, scope: !444)
!460 = !DILocation(line: 57, column: 17, scope: !444)
!461 = !DILocation(line: 58, column: 11, scope: !444)
!462 = !DILocation(line: 58, column: 26, scope: !444)
!463 = !DILocation(line: 58, column: 32, scope: !444)
!464 = !DILocation(line: 58, column: 5, scope: !444)
!465 = !DILocalVariable(name: "local_addr", scope: !444, file: !28, line: 61, type: !248)
!466 = !DILocation(line: 61, column: 24, scope: !444)
!467 = !DILocation(line: 62, column: 5, scope: !444)
!468 = !DILocation(line: 63, column: 16, scope: !444)
!469 = !DILocation(line: 63, column: 27, scope: !444)
!470 = !DILocation(line: 64, column: 16, scope: !444)
!471 = !DILocation(line: 64, column: 25, scope: !444)
!472 = !DILocation(line: 64, column: 32, scope: !444)
!473 = !DILocation(line: 65, column: 27, scope: !444)
!474 = !DILocation(line: 65, column: 16, scope: !444)
!475 = !DILocation(line: 65, column: 25, scope: !444)
!476 = !DILocation(line: 67, column: 14, scope: !477)
!477 = distinct !DILexicalBlock(scope: !444, file: !28, line: 67, column: 9)
!478 = !DILocation(line: 67, column: 20, scope: !477)
!479 = !DILocation(line: 67, column: 9, scope: !477)
!480 = !DILocation(line: 67, column: 72, scope: !477)
!481 = !DILocation(line: 67, column: 9, scope: !444)
!482 = !DILocation(line: 68, column: 9, scope: !483)
!483 = distinct !DILexicalBlock(scope: !477, file: !28, line: 67, column: 77)
!484 = !DILocation(line: 69, column: 15, scope: !483)
!485 = !DILocation(line: 69, column: 9, scope: !483)
!486 = !DILocation(line: 70, column: 9, scope: !483)
!487 = !DILocation(line: 73, column: 5, scope: !444)
!488 = !DILocation(line: 76, column: 5, scope: !444)
!489 = !DILocation(line: 77, column: 27, scope: !490)
!490 = distinct !DILexicalBlock(scope: !444, file: !28, line: 76, column: 15)
!491 = !DILocation(line: 77, column: 9, scope: !490)
!492 = !DILocation(line: 78, column: 9, scope: !490)
!493 = distinct !{!493, !488, !494}
!494 = !DILocation(line: 79, column: 5, scope: !444)
!495 = !DILocation(line: 83, column: 1, scope: !444)
!496 = distinct !DISubprogram(name: "mavlink_frame_char", scope: !3, file: !3, line: 906, type: !361, scopeLine: 907, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!497 = !DILocalVariable(name: "chan", arg: 1, scope: !496, file: !3, line: 906, type: !19)
!498 = !DILocation(line: 906, column: 51, scope: !496)
!499 = !DILocalVariable(name: "c", arg: 2, scope: !496, file: !3, line: 906, type: !19)
!500 = !DILocation(line: 906, column: 65, scope: !496)
!501 = !DILocalVariable(name: "r_message", arg: 3, scope: !496, file: !3, line: 906, type: !138)
!502 = !DILocation(line: 906, column: 87, scope: !496)
!503 = !DILocalVariable(name: "r_mavlink_status", arg: 4, scope: !496, file: !3, line: 906, type: !177)
!504 = !DILocation(line: 906, column: 116, scope: !496)
!505 = !DILocation(line: 908, column: 62, scope: !496)
!506 = !DILocation(line: 908, column: 35, scope: !496)
!507 = !DILocation(line: 909, column: 34, scope: !496)
!508 = !DILocation(line: 909, column: 7, scope: !496)
!509 = !DILocation(line: 910, column: 7, scope: !496)
!510 = !DILocation(line: 911, column: 7, scope: !496)
!511 = !DILocation(line: 912, column: 7, scope: !496)
!512 = !DILocation(line: 908, column: 9, scope: !496)
!513 = !DILocation(line: 908, column: 2, scope: !496)
!514 = !DILocalVariable(name: "chan", arg: 1, scope: !135, file: !3, line: 39, type: !19)
!515 = !DILocation(line: 39, column: 70, scope: !135)
!516 = !DILocation(line: 48, column: 27, scope: !135)
!517 = !DILocation(line: 48, column: 10, scope: !135)
!518 = !DILocation(line: 48, column: 2, scope: !135)
!519 = !DILocalVariable(name: "chan", arg: 1, scope: !174, file: !3, line: 23, type: !19)
!520 = !DILocation(line: 23, column: 69, scope: !174)
!521 = !DILocation(line: 31, column: 27, scope: !174)
!522 = !DILocation(line: 31, column: 10, scope: !174)
!523 = !DILocation(line: 31, column: 2, scope: !174)
!524 = distinct !DISubprogram(name: "_mav_parse_error", scope: !3, file: !3, line: 302, type: !525, scopeLine: 303, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !177}
!527 = !DILocalVariable(name: "status", arg: 1, scope: !524, file: !3, line: 302, type: !177)
!528 = !DILocation(line: 302, column: 55, scope: !524)
!529 = !DILocation(line: 304, column: 5, scope: !524)
!530 = !DILocation(line: 304, column: 13, scope: !524)
!531 = !DILocation(line: 304, column: 24, scope: !524)
!532 = !DILocation(line: 305, column: 1, scope: !524)
!533 = distinct !DISubprogram(name: "mavlink_start_checksum", scope: !3, file: !3, line: 492, type: !534, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !138}
!536 = !DILocalVariable(name: "msg", arg: 1, scope: !533, file: !3, line: 492, type: !138)
!537 = !DILocation(line: 492, column: 63, scope: !533)
!538 = !DILocalVariable(name: "crcTmp", scope: !533, file: !3, line: 494, type: !143)
!539 = !DILocation(line: 494, column: 11, scope: !533)
!540 = !DILocation(line: 495, column: 2, scope: !533)
!541 = !DILocation(line: 496, column: 18, scope: !533)
!542 = !DILocation(line: 496, column: 2, scope: !533)
!543 = !DILocation(line: 496, column: 7, scope: !533)
!544 = !DILocation(line: 496, column: 16, scope: !533)
!545 = !DILocation(line: 497, column: 1, scope: !533)
!546 = distinct !DISubprogram(name: "mavlink_frame_char_buffer", scope: !3, file: !3, line: 582, type: !547, scopeLine: 587, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!547 = !DISubroutineType(types: !548)
!548 = !{!19, !138, !177, !19, !138, !177}
!549 = !DILocalVariable(name: "rxmsg", arg: 1, scope: !546, file: !3, line: 582, type: !138)
!550 = !DILocation(line: 582, column: 69, scope: !546)
!551 = !DILocalVariable(name: "status", arg: 2, scope: !546, file: !3, line: 583, type: !177)
!552 = !DILocation(line: 583, column: 68, scope: !546)
!553 = !DILocalVariable(name: "c", arg: 3, scope: !546, file: !3, line: 584, type: !19)
!554 = !DILocation(line: 584, column: 58, scope: !546)
!555 = !DILocalVariable(name: "r_message", arg: 4, scope: !546, file: !3, line: 585, type: !138)
!556 = !DILocation(line: 585, column: 69, scope: !546)
!557 = !DILocalVariable(name: "r_mavlink_status", arg: 5, scope: !546, file: !3, line: 586, type: !177)
!558 = !DILocation(line: 586, column: 68, scope: !546)
!559 = !DILocalVariable(name: "bufferIndex", scope: !546, file: !3, line: 588, type: !239)
!560 = !DILocation(line: 588, column: 6, scope: !546)
!561 = !DILocation(line: 590, column: 2, scope: !546)
!562 = !DILocation(line: 590, column: 10, scope: !546)
!563 = !DILocation(line: 590, column: 23, scope: !546)
!564 = !DILocation(line: 592, column: 10, scope: !546)
!565 = !DILocation(line: 592, column: 18, scope: !546)
!566 = !DILocation(line: 592, column: 2, scope: !546)
!567 = !DILocation(line: 596, column: 7, scope: !568)
!568 = distinct !DILexicalBlock(scope: !569, file: !3, line: 596, column: 7)
!569 = distinct !DILexicalBlock(scope: !546, file: !3, line: 593, column: 2)
!570 = !DILocation(line: 596, column: 9, scope: !568)
!571 = !DILocation(line: 596, column: 7, scope: !569)
!572 = !DILocation(line: 598, column: 4, scope: !573)
!573 = distinct !DILexicalBlock(scope: !568, file: !3, line: 597, column: 3)
!574 = !DILocation(line: 598, column: 12, scope: !573)
!575 = !DILocation(line: 598, column: 24, scope: !573)
!576 = !DILocation(line: 599, column: 4, scope: !573)
!577 = !DILocation(line: 599, column: 11, scope: !573)
!578 = !DILocation(line: 599, column: 15, scope: !573)
!579 = !DILocation(line: 600, column: 19, scope: !573)
!580 = !DILocation(line: 600, column: 4, scope: !573)
!581 = !DILocation(line: 600, column: 11, scope: !573)
!582 = !DILocation(line: 600, column: 17, scope: !573)
!583 = !DILocation(line: 601, column: 25, scope: !573)
!584 = !DILocation(line: 601, column: 33, scope: !573)
!585 = !DILocation(line: 601, column: 39, scope: !573)
!586 = !DILocation(line: 602, column: 27, scope: !573)
!587 = !DILocation(line: 602, column: 4, scope: !573)
!588 = !DILocation(line: 603, column: 3, scope: !573)
!589 = !DILocation(line: 603, column: 14, scope: !590)
!590 = distinct !DILexicalBlock(scope: !568, file: !3, line: 603, column: 14)
!591 = !DILocation(line: 603, column: 16, scope: !590)
!592 = !DILocation(line: 603, column: 14, scope: !568)
!593 = !DILocation(line: 605, column: 4, scope: !594)
!594 = distinct !DILexicalBlock(scope: !590, file: !3, line: 604, column: 3)
!595 = !DILocation(line: 605, column: 12, scope: !594)
!596 = !DILocation(line: 605, column: 24, scope: !594)
!597 = !DILocation(line: 606, column: 4, scope: !594)
!598 = !DILocation(line: 606, column: 11, scope: !594)
!599 = !DILocation(line: 606, column: 15, scope: !594)
!600 = !DILocation(line: 607, column: 19, scope: !594)
!601 = !DILocation(line: 607, column: 4, scope: !594)
!602 = !DILocation(line: 607, column: 11, scope: !594)
!603 = !DILocation(line: 607, column: 17, scope: !594)
!604 = !DILocation(line: 608, column: 25, scope: !594)
!605 = !DILocation(line: 608, column: 33, scope: !594)
!606 = !DILocation(line: 608, column: 39, scope: !594)
!607 = !DILocation(line: 609, column: 27, scope: !594)
!608 = !DILocation(line: 609, column: 4, scope: !594)
!609 = !DILocation(line: 610, column: 3, scope: !594)
!610 = !DILocation(line: 611, column: 3, scope: !569)
!611 = !DILocation(line: 614, column: 8, scope: !612)
!612 = distinct !DILexicalBlock(scope: !569, file: !3, line: 614, column: 8)
!613 = !DILocation(line: 614, column: 16, scope: !612)
!614 = !DILocation(line: 614, column: 8, scope: !569)
!615 = !DILocation(line: 622, column: 4, scope: !616)
!616 = distinct !DILexicalBlock(scope: !612, file: !3, line: 621, column: 3)
!617 = !DILocation(line: 622, column: 12, scope: !616)
!618 = !DILocation(line: 622, column: 26, scope: !616)
!619 = !DILocation(line: 623, column: 21, scope: !616)
!620 = !DILocation(line: 623, column: 4, scope: !616)
!621 = !DILocation(line: 624, column: 4, scope: !616)
!622 = !DILocation(line: 624, column: 12, scope: !616)
!623 = !DILocation(line: 624, column: 25, scope: !616)
!624 = !DILocation(line: 625, column: 4, scope: !616)
!625 = !DILocation(line: 625, column: 12, scope: !616)
!626 = !DILocation(line: 625, column: 24, scope: !616)
!627 = !DILocation(line: 626, column: 3, scope: !616)
!628 = !DILocation(line: 630, column: 17, scope: !629)
!629 = distinct !DILexicalBlock(scope: !612, file: !3, line: 628, column: 3)
!630 = !DILocation(line: 630, column: 4, scope: !629)
!631 = !DILocation(line: 630, column: 11, scope: !629)
!632 = !DILocation(line: 630, column: 15, scope: !629)
!633 = !DILocation(line: 631, column: 4, scope: !629)
!634 = !DILocation(line: 631, column: 12, scope: !629)
!635 = !DILocation(line: 631, column: 23, scope: !629)
!636 = !DILocation(line: 632, column: 28, scope: !629)
!637 = !DILocation(line: 632, column: 35, scope: !629)
!638 = !DILocation(line: 632, column: 4, scope: !629)
!639 = !DILocation(line: 633, column: 29, scope: !640)
!640 = distinct !DILexicalBlock(scope: !629, file: !3, line: 633, column: 29)
!641 = !DILocation(line: 633, column: 37, scope: !640)
!642 = !DILocation(line: 633, column: 43, scope: !640)
!643 = !DILocation(line: 633, column: 29, scope: !629)
!644 = !DILocation(line: 634, column: 29, scope: !645)
!645 = distinct !DILexicalBlock(scope: !640, file: !3, line: 633, column: 78)
!646 = !DILocation(line: 634, column: 36, scope: !645)
!647 = !DILocation(line: 634, column: 51, scope: !645)
!648 = !DILocation(line: 635, column: 29, scope: !645)
!649 = !DILocation(line: 635, column: 36, scope: !645)
!650 = !DILocation(line: 635, column: 49, scope: !645)
!651 = !DILocation(line: 636, column: 29, scope: !645)
!652 = !DILocation(line: 636, column: 37, scope: !645)
!653 = !DILocation(line: 636, column: 49, scope: !645)
!654 = !DILocation(line: 637, column: 25, scope: !645)
!655 = !DILocation(line: 638, column: 29, scope: !656)
!656 = distinct !DILexicalBlock(scope: !640, file: !3, line: 637, column: 32)
!657 = !DILocation(line: 638, column: 37, scope: !656)
!658 = !DILocation(line: 638, column: 49, scope: !656)
!659 = !DILocation(line: 641, column: 3, scope: !569)
!660 = !DILocation(line: 644, column: 27, scope: !569)
!661 = !DILocation(line: 644, column: 3, scope: !569)
!662 = !DILocation(line: 644, column: 10, scope: !569)
!663 = !DILocation(line: 644, column: 25, scope: !569)
!664 = !DILocation(line: 645, column: 8, scope: !665)
!665 = distinct !DILexicalBlock(scope: !569, file: !3, line: 645, column: 7)
!666 = !DILocation(line: 645, column: 15, scope: !665)
!667 = !DILocation(line: 645, column: 30, scope: !665)
!668 = !DILocation(line: 645, column: 53, scope: !665)
!669 = !DILocation(line: 645, column: 7, scope: !569)
!670 = !DILocation(line: 647, column: 21, scope: !671)
!671 = distinct !DILexicalBlock(scope: !665, file: !3, line: 645, column: 59)
!672 = !DILocation(line: 647, column: 4, scope: !671)
!673 = !DILocation(line: 648, column: 4, scope: !671)
!674 = !DILocation(line: 648, column: 12, scope: !671)
!675 = !DILocation(line: 648, column: 25, scope: !671)
!676 = !DILocation(line: 649, column: 4, scope: !671)
!677 = !DILocation(line: 649, column: 12, scope: !671)
!678 = !DILocation(line: 649, column: 24, scope: !671)
!679 = !DILocation(line: 650, column: 4, scope: !671)
!680 = !DILocation(line: 652, column: 27, scope: !569)
!681 = !DILocation(line: 652, column: 34, scope: !569)
!682 = !DILocation(line: 652, column: 3, scope: !569)
!683 = !DILocation(line: 653, column: 3, scope: !569)
!684 = !DILocation(line: 653, column: 11, scope: !569)
!685 = !DILocation(line: 653, column: 23, scope: !569)
!686 = !DILocation(line: 654, column: 3, scope: !569)
!687 = !DILocation(line: 657, column: 25, scope: !569)
!688 = !DILocation(line: 657, column: 3, scope: !569)
!689 = !DILocation(line: 657, column: 10, scope: !569)
!690 = !DILocation(line: 657, column: 23, scope: !569)
!691 = !DILocation(line: 658, column: 27, scope: !569)
!692 = !DILocation(line: 658, column: 34, scope: !569)
!693 = !DILocation(line: 658, column: 3, scope: !569)
!694 = !DILocation(line: 659, column: 3, scope: !569)
!695 = !DILocation(line: 659, column: 11, scope: !569)
!696 = !DILocation(line: 659, column: 23, scope: !569)
!697 = !DILocation(line: 660, column: 3, scope: !569)
!698 = !DILocation(line: 663, column: 16, scope: !569)
!699 = !DILocation(line: 663, column: 3, scope: !569)
!700 = !DILocation(line: 663, column: 10, scope: !569)
!701 = !DILocation(line: 663, column: 14, scope: !569)
!702 = !DILocation(line: 664, column: 27, scope: !569)
!703 = !DILocation(line: 664, column: 34, scope: !569)
!704 = !DILocation(line: 664, column: 3, scope: !569)
!705 = !DILocation(line: 665, column: 3, scope: !569)
!706 = !DILocation(line: 665, column: 11, scope: !569)
!707 = !DILocation(line: 665, column: 23, scope: !569)
!708 = !DILocation(line: 666, column: 3, scope: !569)
!709 = !DILocation(line: 669, column: 18, scope: !569)
!710 = !DILocation(line: 669, column: 3, scope: !569)
!711 = !DILocation(line: 669, column: 10, scope: !569)
!712 = !DILocation(line: 669, column: 16, scope: !569)
!713 = !DILocation(line: 670, column: 27, scope: !569)
!714 = !DILocation(line: 670, column: 34, scope: !569)
!715 = !DILocation(line: 670, column: 3, scope: !569)
!716 = !DILocation(line: 671, column: 3, scope: !569)
!717 = !DILocation(line: 671, column: 11, scope: !569)
!718 = !DILocation(line: 671, column: 23, scope: !569)
!719 = !DILocation(line: 672, column: 3, scope: !569)
!720 = !DILocation(line: 675, column: 19, scope: !569)
!721 = !DILocation(line: 675, column: 3, scope: !569)
!722 = !DILocation(line: 675, column: 10, scope: !569)
!723 = !DILocation(line: 675, column: 17, scope: !569)
!724 = !DILocation(line: 676, column: 27, scope: !569)
!725 = !DILocation(line: 676, column: 34, scope: !569)
!726 = !DILocation(line: 676, column: 3, scope: !569)
!727 = !DILocation(line: 677, column: 17, scope: !569)
!728 = !DILocation(line: 677, column: 25, scope: !569)
!729 = !DILocation(line: 677, column: 37, scope: !569)
!730 = !DILocation(line: 678, column: 3, scope: !569)
!731 = !DILocation(line: 681, column: 18, scope: !569)
!732 = !DILocation(line: 681, column: 3, scope: !569)
!733 = !DILocation(line: 681, column: 10, scope: !569)
!734 = !DILocation(line: 681, column: 16, scope: !569)
!735 = !DILocation(line: 682, column: 27, scope: !569)
!736 = !DILocation(line: 682, column: 34, scope: !569)
!737 = !DILocation(line: 682, column: 3, scope: !569)
!738 = !DILocation(line: 683, column: 7, scope: !739)
!739 = distinct !DILexicalBlock(scope: !569, file: !3, line: 683, column: 7)
!740 = !DILocation(line: 683, column: 15, scope: !739)
!741 = !DILocation(line: 683, column: 21, scope: !739)
!742 = !DILocation(line: 683, column: 7, scope: !569)
!743 = !DILocation(line: 684, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !3, line: 684, column: 7)
!745 = distinct !DILexicalBlock(scope: !739, file: !3, line: 683, column: 56)
!746 = !DILocation(line: 684, column: 14, scope: !744)
!747 = !DILocation(line: 684, column: 18, scope: !744)
!748 = !DILocation(line: 684, column: 7, scope: !745)
!749 = !DILocation(line: 685, column: 5, scope: !750)
!750 = distinct !DILexicalBlock(scope: !744, file: !3, line: 684, column: 23)
!751 = !DILocation(line: 685, column: 13, scope: !750)
!752 = !DILocation(line: 685, column: 25, scope: !750)
!753 = !DILocation(line: 686, column: 4, scope: !750)
!754 = !DILocation(line: 687, column: 5, scope: !755)
!755 = distinct !DILexicalBlock(scope: !744, file: !3, line: 686, column: 11)
!756 = !DILocation(line: 687, column: 13, scope: !755)
!757 = !DILocation(line: 687, column: 25, scope: !755)
!758 = !DILocation(line: 697, column: 3, scope: !745)
!759 = !DILocation(line: 698, column: 4, scope: !760)
!760 = distinct !DILexicalBlock(scope: !739, file: !3, line: 697, column: 10)
!761 = !DILocation(line: 698, column: 12, scope: !760)
!762 = !DILocation(line: 698, column: 24, scope: !760)
!763 = !DILocation(line: 700, column: 3, scope: !569)
!764 = !DILocation(line: 703, column: 19, scope: !569)
!765 = !DILocation(line: 703, column: 20, scope: !569)
!766 = !DILocation(line: 703, column: 3, scope: !569)
!767 = !DILocation(line: 703, column: 10, scope: !569)
!768 = !DILocation(line: 703, column: 16, scope: !569)
!769 = !DILocation(line: 704, column: 27, scope: !569)
!770 = !DILocation(line: 704, column: 34, scope: !569)
!771 = !DILocation(line: 704, column: 3, scope: !569)
!772 = !DILocation(line: 705, column: 3, scope: !569)
!773 = !DILocation(line: 705, column: 11, scope: !569)
!774 = !DILocation(line: 705, column: 23, scope: !569)
!775 = !DILocation(line: 706, column: 3, scope: !569)
!776 = !DILocation(line: 709, column: 30, scope: !569)
!777 = !DILocation(line: 709, column: 20, scope: !569)
!778 = !DILocation(line: 709, column: 32, scope: !569)
!779 = !DILocation(line: 709, column: 3, scope: !569)
!780 = !DILocation(line: 709, column: 10, scope: !569)
!781 = !DILocation(line: 709, column: 16, scope: !569)
!782 = !DILocation(line: 710, column: 27, scope: !569)
!783 = !DILocation(line: 710, column: 34, scope: !569)
!784 = !DILocation(line: 710, column: 3, scope: !569)
!785 = !DILocation(line: 711, column: 6, scope: !786)
!786 = distinct !DILexicalBlock(scope: !569, file: !3, line: 711, column: 6)
!787 = !DILocation(line: 711, column: 13, scope: !786)
!788 = !DILocation(line: 711, column: 17, scope: !786)
!789 = !DILocation(line: 711, column: 6, scope: !569)
!790 = !DILocation(line: 712, column: 4, scope: !791)
!791 = distinct !DILexicalBlock(scope: !786, file: !3, line: 711, column: 21)
!792 = !DILocation(line: 712, column: 12, scope: !791)
!793 = !DILocation(line: 712, column: 24, scope: !791)
!794 = !DILocation(line: 713, column: 3, scope: !791)
!795 = !DILocation(line: 714, column: 4, scope: !796)
!796 = distinct !DILexicalBlock(scope: !786, file: !3, line: 713, column: 10)
!797 = !DILocation(line: 714, column: 12, scope: !796)
!798 = !DILocation(line: 714, column: 24, scope: !796)
!799 = !DILocation(line: 725, column: 3, scope: !569)
!800 = !DILocation(line: 728, column: 63, scope: !569)
!801 = !DILocation(line: 728, column: 3, scope: !569)
!802 = !DILocation(line: 728, column: 33, scope: !569)
!803 = !DILocation(line: 728, column: 41, scope: !569)
!804 = !DILocation(line: 728, column: 51, scope: !569)
!805 = !DILocation(line: 728, column: 55, scope: !569)
!806 = !DILocation(line: 729, column: 27, scope: !569)
!807 = !DILocation(line: 729, column: 34, scope: !569)
!808 = !DILocation(line: 729, column: 3, scope: !569)
!809 = !DILocation(line: 730, column: 7, scope: !810)
!810 = distinct !DILexicalBlock(scope: !569, file: !3, line: 730, column: 7)
!811 = !DILocation(line: 730, column: 15, scope: !810)
!812 = !DILocation(line: 730, column: 29, scope: !810)
!813 = !DILocation(line: 730, column: 36, scope: !810)
!814 = !DILocation(line: 730, column: 26, scope: !810)
!815 = !DILocation(line: 730, column: 7, scope: !569)
!816 = !DILocation(line: 732, column: 4, scope: !817)
!817 = distinct !DILexicalBlock(scope: !810, file: !3, line: 731, column: 3)
!818 = !DILocation(line: 732, column: 12, scope: !817)
!819 = !DILocation(line: 732, column: 24, scope: !817)
!820 = !DILocation(line: 733, column: 3, scope: !817)
!821 = !DILocation(line: 734, column: 3, scope: !569)
!822 = !DILocalVariable(name: "e", scope: !823, file: !3, line: 737, type: !6)
!823 = distinct !DILexicalBlock(scope: !569, file: !3, line: 736, column: 40)
!824 = !DILocation(line: 737, column: 30, scope: !823)
!825 = !DILocation(line: 737, column: 56, scope: !823)
!826 = !DILocation(line: 737, column: 63, scope: !823)
!827 = !DILocation(line: 737, column: 34, scope: !823)
!828 = !DILocalVariable(name: "crc_extra", scope: !823, file: !3, line: 738, type: !19)
!829 = !DILocation(line: 738, column: 11, scope: !823)
!830 = !DILocation(line: 738, column: 23, scope: !823)
!831 = !DILocation(line: 738, column: 25, scope: !823)
!832 = !DILocation(line: 738, column: 28, scope: !823)
!833 = !DILocation(line: 739, column: 27, scope: !823)
!834 = !DILocation(line: 739, column: 34, scope: !823)
!835 = !DILocation(line: 739, column: 3, scope: !823)
!836 = !DILocation(line: 740, column: 7, scope: !837)
!837 = distinct !DILexicalBlock(scope: !823, file: !3, line: 740, column: 7)
!838 = !DILocation(line: 740, column: 13, scope: !837)
!839 = !DILocation(line: 740, column: 20, scope: !837)
!840 = !DILocation(line: 740, column: 29, scope: !837)
!841 = !DILocation(line: 740, column: 9, scope: !837)
!842 = !DILocation(line: 740, column: 7, scope: !823)
!843 = !DILocation(line: 741, column: 4, scope: !844)
!844 = distinct !DILexicalBlock(scope: !837, file: !3, line: 740, column: 38)
!845 = !DILocation(line: 741, column: 12, scope: !844)
!846 = !DILocation(line: 741, column: 24, scope: !844)
!847 = !DILocation(line: 742, column: 3, scope: !844)
!848 = !DILocation(line: 743, column: 4, scope: !849)
!849 = distinct !DILexicalBlock(scope: !837, file: !3, line: 742, column: 10)
!850 = !DILocation(line: 743, column: 12, scope: !849)
!851 = !DILocation(line: 743, column: 24, scope: !849)
!852 = !DILocation(line: 745, column: 32, scope: !823)
!853 = !DILocation(line: 745, column: 17, scope: !823)
!854 = !DILocation(line: 745, column: 24, scope: !823)
!855 = !DILocation(line: 745, column: 30, scope: !823)
!856 = !DILocation(line: 748, column: 21, scope: !857)
!857 = distinct !DILexicalBlock(scope: !823, file: !3, line: 748, column: 21)
!858 = !DILocation(line: 748, column: 23, scope: !857)
!859 = !DILocation(line: 748, column: 26, scope: !857)
!860 = !DILocation(line: 748, column: 34, scope: !857)
!861 = !DILocation(line: 748, column: 47, scope: !857)
!862 = !DILocation(line: 748, column: 50, scope: !857)
!863 = !DILocation(line: 748, column: 45, scope: !857)
!864 = !DILocation(line: 748, column: 21, scope: !823)
!865 = !DILocation(line: 749, column: 33, scope: !866)
!866 = distinct !DILexicalBlock(scope: !857, file: !3, line: 748, column: 63)
!867 = !DILocation(line: 749, column: 63, scope: !866)
!868 = !DILocation(line: 749, column: 71, scope: !866)
!869 = !DILocation(line: 749, column: 87, scope: !866)
!870 = !DILocation(line: 749, column: 90, scope: !866)
!871 = !DILocation(line: 749, column: 104, scope: !866)
!872 = !DILocation(line: 749, column: 112, scope: !866)
!873 = !DILocation(line: 749, column: 102, scope: !866)
!874 = !DILocation(line: 749, column: 25, scope: !866)
!875 = !DILocation(line: 750, column: 3, scope: !866)
!876 = !DILocation(line: 751, column: 3, scope: !823)
!877 = !DILocation(line: 756, column: 7, scope: !878)
!878 = distinct !DILexicalBlock(scope: !569, file: !3, line: 756, column: 7)
!879 = !DILocation(line: 756, column: 15, scope: !878)
!880 = !DILocation(line: 756, column: 27, scope: !878)
!881 = !DILocation(line: 756, column: 63, scope: !878)
!882 = !DILocation(line: 756, column: 66, scope: !878)
!883 = !DILocation(line: 756, column: 72, scope: !878)
!884 = !DILocation(line: 756, column: 79, scope: !878)
!885 = !DILocation(line: 756, column: 88, scope: !878)
!886 = !DILocation(line: 756, column: 68, scope: !878)
!887 = !DILocation(line: 756, column: 7, scope: !569)
!888 = !DILocation(line: 758, column: 4, scope: !889)
!889 = distinct !DILexicalBlock(scope: !878, file: !3, line: 756, column: 95)
!890 = !DILocation(line: 758, column: 12, scope: !889)
!891 = !DILocation(line: 758, column: 25, scope: !889)
!892 = !DILocation(line: 759, column: 3, scope: !889)
!893 = !DILocation(line: 761, column: 4, scope: !894)
!894 = distinct !DILexicalBlock(scope: !878, file: !3, line: 759, column: 10)
!895 = !DILocation(line: 761, column: 12, scope: !894)
!896 = !DILocation(line: 761, column: 25, scope: !894)
!897 = !DILocation(line: 763, column: 18, scope: !569)
!898 = !DILocation(line: 763, column: 3, scope: !569)
!899 = !DILocation(line: 763, column: 10, scope: !569)
!900 = !DILocation(line: 763, column: 16, scope: !569)
!901 = !DILocation(line: 765, column: 7, scope: !902)
!902 = distinct !DILexicalBlock(scope: !569, file: !3, line: 765, column: 7)
!903 = !DILocation(line: 765, column: 14, scope: !902)
!904 = !DILocation(line: 765, column: 29, scope: !902)
!905 = !DILocation(line: 765, column: 7, scope: !569)
!906 = !DILocation(line: 766, column: 4, scope: !907)
!907 = distinct !DILexicalBlock(scope: !902, file: !3, line: 765, column: 53)
!908 = !DILocation(line: 766, column: 12, scope: !907)
!909 = !DILocation(line: 766, column: 24, scope: !907)
!910 = !DILocation(line: 767, column: 4, scope: !907)
!911 = !DILocation(line: 767, column: 12, scope: !907)
!912 = !DILocation(line: 767, column: 27, scope: !907)
!913 = !DILocation(line: 771, column: 8, scope: !914)
!914 = distinct !DILexicalBlock(scope: !907, file: !3, line: 771, column: 8)
!915 = !DILocation(line: 771, column: 16, scope: !914)
!916 = !DILocation(line: 771, column: 29, scope: !914)
!917 = !DILocation(line: 771, column: 8, scope: !907)
!918 = !DILocation(line: 772, column: 5, scope: !919)
!919 = distinct !DILexicalBlock(scope: !914, file: !3, line: 771, column: 57)
!920 = !DILocation(line: 772, column: 13, scope: !919)
!921 = !DILocation(line: 772, column: 26, scope: !919)
!922 = !DILocation(line: 773, column: 4, scope: !919)
!923 = !DILocation(line: 774, column: 3, scope: !907)
!924 = !DILocation(line: 775, column: 8, scope: !925)
!925 = distinct !DILexicalBlock(scope: !926, file: !3, line: 775, column: 8)
!926 = distinct !DILexicalBlock(scope: !902, file: !3, line: 774, column: 10)
!927 = !DILocation(line: 775, column: 16, scope: !925)
!928 = !DILocation(line: 775, column: 24, scope: !925)
!929 = !DILocation(line: 776, column: 9, scope: !925)
!930 = !DILocation(line: 776, column: 17, scope: !925)
!931 = !DILocation(line: 776, column: 26, scope: !925)
!932 = !DILocation(line: 776, column: 51, scope: !925)
!933 = !DILocation(line: 776, column: 59, scope: !925)
!934 = !DILocation(line: 777, column: 10, scope: !925)
!935 = !DILocation(line: 777, column: 18, scope: !925)
!936 = !DILocation(line: 777, column: 27, scope: !925)
!937 = !DILocation(line: 777, column: 52, scope: !925)
!938 = !DILocation(line: 777, column: 60, scope: !925)
!939 = !DILocation(line: 777, column: 67, scope: !925)
!940 = !DILocation(line: 775, column: 8, scope: !926)
!941 = !DILocation(line: 780, column: 9, scope: !942)
!942 = distinct !DILexicalBlock(scope: !943, file: !3, line: 780, column: 9)
!943 = distinct !DILexicalBlock(scope: !925, file: !3, line: 777, column: 76)
!944 = !DILocation(line: 780, column: 17, scope: !942)
!945 = !DILocation(line: 780, column: 30, scope: !942)
!946 = !DILocation(line: 780, column: 9, scope: !943)
!947 = !DILocation(line: 781, column: 6, scope: !948)
!948 = distinct !DILexicalBlock(scope: !942, file: !3, line: 780, column: 58)
!949 = !DILocation(line: 781, column: 14, scope: !948)
!950 = !DILocation(line: 781, column: 27, scope: !948)
!951 = !DILocation(line: 782, column: 5, scope: !948)
!952 = !DILocation(line: 783, column: 4, scope: !943)
!953 = !DILocation(line: 784, column: 4, scope: !926)
!954 = !DILocation(line: 784, column: 12, scope: !926)
!955 = !DILocation(line: 784, column: 24, scope: !926)
!956 = !DILocation(line: 785, column: 8, scope: !957)
!957 = distinct !DILexicalBlock(scope: !926, file: !3, line: 785, column: 8)
!958 = !DILocation(line: 785, column: 18, scope: !957)
!959 = !DILocation(line: 785, column: 8, scope: !926)
!960 = !DILocation(line: 786, column: 12, scope: !961)
!961 = distinct !DILexicalBlock(scope: !957, file: !3, line: 785, column: 27)
!962 = !DILocation(line: 786, column: 5, scope: !961)
!963 = !DILocation(line: 786, column: 23, scope: !961)
!964 = !DILocation(line: 787, column: 4, scope: !961)
!965 = !DILocation(line: 789, column: 3, scope: !569)
!966 = !DILocation(line: 791, column: 74, scope: !569)
!967 = !DILocation(line: 791, column: 3, scope: !569)
!968 = !DILocation(line: 791, column: 10, scope: !569)
!969 = !DILocation(line: 791, column: 48, scope: !569)
!970 = !DILocation(line: 791, column: 56, scope: !569)
!971 = !DILocation(line: 791, column: 47, scope: !569)
!972 = !DILocation(line: 791, column: 72, scope: !569)
!973 = !DILocation(line: 792, column: 3, scope: !569)
!974 = !DILocation(line: 792, column: 11, scope: !569)
!975 = !DILocation(line: 792, column: 25, scope: !569)
!976 = !DILocation(line: 793, column: 7, scope: !977)
!977 = distinct !DILexicalBlock(scope: !569, file: !3, line: 793, column: 7)
!978 = !DILocation(line: 793, column: 15, scope: !977)
!979 = !DILocation(line: 793, column: 30, scope: !977)
!980 = !DILocation(line: 793, column: 7, scope: !569)
!981 = !DILocalVariable(name: "sig_ok", scope: !982, file: !3, line: 796, type: !209)
!982 = distinct !DILexicalBlock(scope: !977, file: !3, line: 793, column: 36)
!983 = !DILocation(line: 796, column: 9, scope: !982)
!984 = !DILocation(line: 796, column: 42, scope: !982)
!985 = !DILocation(line: 796, column: 50, scope: !982)
!986 = !DILocation(line: 796, column: 59, scope: !982)
!987 = !DILocation(line: 796, column: 67, scope: !982)
!988 = !DILocation(line: 796, column: 84, scope: !982)
!989 = !DILocation(line: 796, column: 18, scope: !982)
!990 = !DILocation(line: 800, column: 9, scope: !991)
!991 = distinct !DILexicalBlock(scope: !982, file: !3, line: 800, column: 8)
!992 = !DILocation(line: 800, column: 16, scope: !991)
!993 = !DILocation(line: 801, column: 9, scope: !991)
!994 = !DILocation(line: 801, column: 17, scope: !991)
!995 = !DILocation(line: 801, column: 26, scope: !991)
!996 = !DILocation(line: 801, column: 51, scope: !991)
!997 = !DILocation(line: 802, column: 9, scope: !991)
!998 = !DILocation(line: 802, column: 17, scope: !991)
!999 = !DILocation(line: 802, column: 26, scope: !991)
!1000 = !DILocation(line: 802, column: 51, scope: !991)
!1001 = !DILocation(line: 802, column: 59, scope: !991)
!1002 = !DILocation(line: 802, column: 66, scope: !991)
!1003 = !DILocation(line: 800, column: 8, scope: !982)
!1004 = !DILocation(line: 804, column: 12, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !991, file: !3, line: 802, column: 75)
!1006 = !DILocation(line: 805, column: 4, scope: !1005)
!1007 = !DILocation(line: 806, column: 8, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !982, file: !3, line: 806, column: 8)
!1009 = !DILocation(line: 806, column: 8, scope: !982)
!1010 = !DILocation(line: 807, column: 5, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 806, column: 16)
!1012 = !DILocation(line: 807, column: 13, scope: !1011)
!1013 = !DILocation(line: 807, column: 26, scope: !1011)
!1014 = !DILocation(line: 808, column: 4, scope: !1011)
!1015 = !DILocation(line: 809, column: 5, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 808, column: 11)
!1017 = !DILocation(line: 809, column: 13, scope: !1016)
!1018 = !DILocation(line: 809, column: 26, scope: !1016)
!1019 = !DILocation(line: 811, column: 4, scope: !982)
!1020 = !DILocation(line: 811, column: 12, scope: !982)
!1021 = !DILocation(line: 811, column: 24, scope: !982)
!1022 = !DILocation(line: 812, column: 8, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !982, file: !3, line: 812, column: 8)
!1024 = !DILocation(line: 812, column: 18, scope: !1023)
!1025 = !DILocation(line: 812, column: 8, scope: !982)
!1026 = !DILocation(line: 813, column: 12, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 812, column: 26)
!1028 = !DILocation(line: 813, column: 5, scope: !1027)
!1029 = !DILocation(line: 813, column: 23, scope: !1027)
!1030 = !DILocation(line: 814, column: 4, scope: !1027)
!1031 = !DILocation(line: 815, column: 3, scope: !982)
!1032 = !DILocation(line: 816, column: 3, scope: !569)
!1033 = !DILocation(line: 819, column: 13, scope: !546)
!1034 = !DILocation(line: 821, column: 6, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !546, file: !3, line: 821, column: 6)
!1036 = !DILocation(line: 821, column: 14, scope: !1035)
!1037 = !DILocation(line: 821, column: 27, scope: !1035)
!1038 = !DILocation(line: 821, column: 6, scope: !546)
!1039 = !DILocation(line: 828, column: 28, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 822, column: 2)
!1041 = !DILocation(line: 828, column: 35, scope: !1040)
!1042 = !DILocation(line: 828, column: 3, scope: !1040)
!1043 = !DILocation(line: 828, column: 11, scope: !1040)
!1044 = !DILocation(line: 828, column: 26, scope: !1040)
!1045 = !DILocation(line: 830, column: 7, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 830, column: 7)
!1047 = !DILocation(line: 830, column: 15, scope: !1046)
!1048 = !DILocation(line: 830, column: 39, scope: !1046)
!1049 = !DILocation(line: 830, column: 7, scope: !1040)
!1050 = !DILocation(line: 830, column: 45, scope: !1046)
!1051 = !DILocation(line: 830, column: 53, scope: !1046)
!1052 = !DILocation(line: 830, column: 74, scope: !1046)
!1053 = !DILocation(line: 832, column: 3, scope: !1040)
!1054 = !DILocation(line: 832, column: 11, scope: !1040)
!1055 = !DILocation(line: 832, column: 34, scope: !1040)
!1056 = !DILocation(line: 833, column: 2, scope: !1040)
!1057 = !DILocation(line: 835, column: 12, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !546, file: !3, line: 835, column: 12)
!1059 = !DILocation(line: 835, column: 22, scope: !1058)
!1060 = !DILocation(line: 835, column: 12, scope: !546)
!1061 = !DILocation(line: 836, column: 29, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 835, column: 31)
!1063 = !DILocation(line: 836, column: 36, scope: !1062)
!1064 = !DILocation(line: 836, column: 12, scope: !1062)
!1065 = !DILocation(line: 836, column: 23, scope: !1062)
!1066 = !DILocation(line: 836, column: 27, scope: !1062)
!1067 = !DILocation(line: 837, column: 8, scope: !1062)
!1068 = !DILocation(line: 838, column: 12, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !546, file: !3, line: 838, column: 12)
!1070 = !DILocation(line: 838, column: 29, scope: !1069)
!1071 = !DILocation(line: 838, column: 12, scope: !546)
!1072 = !DILocation(line: 839, column: 44, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 838, column: 38)
!1074 = !DILocation(line: 839, column: 52, scope: !1073)
!1075 = !DILocation(line: 839, column: 12, scope: !1073)
!1076 = !DILocation(line: 839, column: 30, scope: !1073)
!1077 = !DILocation(line: 839, column: 42, scope: !1073)
!1078 = !DILocation(line: 840, column: 43, scope: !1073)
!1079 = !DILocation(line: 840, column: 51, scope: !1073)
!1080 = !DILocation(line: 840, column: 12, scope: !1073)
!1081 = !DILocation(line: 840, column: 30, scope: !1073)
!1082 = !DILocation(line: 840, column: 41, scope: !1073)
!1083 = !DILocation(line: 841, column: 47, scope: !1073)
!1084 = !DILocation(line: 841, column: 55, scope: !1073)
!1085 = !DILocation(line: 841, column: 69, scope: !1073)
!1086 = !DILocation(line: 841, column: 12, scope: !1073)
!1087 = !DILocation(line: 841, column: 30, scope: !1073)
!1088 = !DILocation(line: 841, column: 45, scope: !1073)
!1089 = !DILocation(line: 842, column: 56, scope: !1073)
!1090 = !DILocation(line: 842, column: 64, scope: !1073)
!1091 = !DILocation(line: 842, column: 12, scope: !1073)
!1092 = !DILocation(line: 842, column: 30, scope: !1073)
!1093 = !DILocation(line: 842, column: 54, scope: !1073)
!1094 = !DILocation(line: 843, column: 53, scope: !1073)
!1095 = !DILocation(line: 843, column: 61, scope: !1073)
!1096 = !DILocation(line: 843, column: 12, scope: !1073)
!1097 = !DILocation(line: 843, column: 30, scope: !1073)
!1098 = !DILocation(line: 843, column: 51, scope: !1073)
!1099 = !DILocation(line: 844, column: 38, scope: !1073)
!1100 = !DILocation(line: 844, column: 46, scope: !1073)
!1101 = !DILocation(line: 844, column: 12, scope: !1073)
!1102 = !DILocation(line: 844, column: 30, scope: !1073)
!1103 = !DILocation(line: 844, column: 36, scope: !1073)
!1104 = !DILocation(line: 845, column: 8, scope: !1073)
!1105 = !DILocation(line: 846, column: 8, scope: !546)
!1106 = !DILocation(line: 846, column: 16, scope: !546)
!1107 = !DILocation(line: 846, column: 28, scope: !546)
!1108 = !DILocation(line: 848, column: 6, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !546, file: !3, line: 848, column: 6)
!1110 = !DILocation(line: 848, column: 14, scope: !1109)
!1111 = !DILocation(line: 848, column: 27, scope: !1109)
!1112 = !DILocation(line: 848, column: 6, scope: !546)
!1113 = !DILocation(line: 856, column: 17, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 856, column: 17)
!1115 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 848, column: 55)
!1116 = !DILocation(line: 856, column: 27, scope: !1114)
!1117 = !DILocation(line: 856, column: 17, scope: !1115)
!1118 = !DILocation(line: 857, column: 39, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 856, column: 36)
!1120 = !DILocation(line: 857, column: 46, scope: !1119)
!1121 = !DILocation(line: 857, column: 55, scope: !1119)
!1122 = !DILocation(line: 857, column: 62, scope: !1119)
!1123 = !DILocation(line: 857, column: 67, scope: !1119)
!1124 = !DILocation(line: 857, column: 52, scope: !1119)
!1125 = !DILocation(line: 857, column: 17, scope: !1119)
!1126 = !DILocation(line: 857, column: 28, scope: !1119)
!1127 = !DILocation(line: 857, column: 37, scope: !1119)
!1128 = !DILocation(line: 858, column: 13, scope: !1119)
!1129 = !DILocation(line: 859, column: 2, scope: !1115)
!1130 = !DILocation(line: 861, column: 9, scope: !546)
!1131 = !DILocation(line: 861, column: 17, scope: !546)
!1132 = !DILocation(line: 861, column: 2, scope: !546)
!1133 = distinct !DISubprogram(name: "mavlink_update_checksum", scope: !3, file: !3, line: 499, type: !1134, scopeLine: 500, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !138, !19}
!1136 = !DILocalVariable(name: "msg", arg: 1, scope: !1133, file: !3, line: 499, type: !138)
!1137 = !DILocation(line: 499, column: 64, scope: !1133)
!1138 = !DILocalVariable(name: "c", arg: 2, scope: !1133, file: !3, line: 499, type: !19)
!1139 = !DILocation(line: 499, column: 77, scope: !1133)
!1140 = !DILocalVariable(name: "checksum", scope: !1133, file: !3, line: 501, type: !143)
!1141 = !DILocation(line: 501, column: 11, scope: !1133)
!1142 = !DILocation(line: 501, column: 22, scope: !1133)
!1143 = !DILocation(line: 501, column: 27, scope: !1133)
!1144 = !DILocation(line: 502, column: 17, scope: !1133)
!1145 = !DILocation(line: 502, column: 2, scope: !1133)
!1146 = !DILocation(line: 503, column: 18, scope: !1133)
!1147 = !DILocation(line: 503, column: 2, scope: !1133)
!1148 = !DILocation(line: 503, column: 7, scope: !1133)
!1149 = !DILocation(line: 503, column: 16, scope: !1133)
!1150 = !DILocation(line: 504, column: 1, scope: !1133)
!1151 = !DILocalVariable(name: "msgid", arg: 1, scope: !2, file: !3, line: 510, type: !13)
!1152 = !DILocation(line: 510, column: 74, scope: !2)
!1153 = !DILocalVariable(name: "low", scope: !2, file: !3, line: 517, type: !13)
!1154 = !DILocation(line: 517, column: 18, scope: !2)
!1155 = !DILocalVariable(name: "high", scope: !2, file: !3, line: 517, type: !13)
!1156 = !DILocation(line: 517, column: 25, scope: !2)
!1157 = !DILocation(line: 518, column: 9, scope: !2)
!1158 = !DILocation(line: 518, column: 16, scope: !2)
!1159 = !DILocation(line: 518, column: 22, scope: !2)
!1160 = !DILocation(line: 518, column: 20, scope: !2)
!1161 = !DILocalVariable(name: "mid", scope: !1162, file: !3, line: 519, type: !13)
!1162 = distinct !DILexicalBlock(scope: !2, file: !3, line: 518, column: 28)
!1163 = !DILocation(line: 519, column: 22, scope: !1162)
!1164 = !DILocation(line: 519, column: 29, scope: !1162)
!1165 = !DILocation(line: 519, column: 32, scope: !1162)
!1166 = !DILocation(line: 519, column: 35, scope: !1162)
!1167 = !DILocation(line: 519, column: 34, scope: !1162)
!1168 = !DILocation(line: 519, column: 40, scope: !1162)
!1169 = !DILocation(line: 520, column: 17, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 520, column: 17)
!1171 = !DILocation(line: 520, column: 46, scope: !1170)
!1172 = !DILocation(line: 520, column: 25, scope: !1170)
!1173 = !DILocation(line: 520, column: 51, scope: !1170)
!1174 = !DILocation(line: 520, column: 23, scope: !1170)
!1175 = !DILocation(line: 520, column: 17, scope: !1162)
!1176 = !DILocation(line: 521, column: 24, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 520, column: 58)
!1178 = !DILocation(line: 521, column: 27, scope: !1177)
!1179 = !DILocation(line: 521, column: 22, scope: !1177)
!1180 = !DILocation(line: 522, column: 17, scope: !1177)
!1181 = distinct !{!1181, !1157, !1182}
!1182 = !DILocation(line: 530, column: 9, scope: !2)
!1183 = !DILocation(line: 524, column: 17, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 524, column: 17)
!1185 = !DILocation(line: 524, column: 46, scope: !1184)
!1186 = !DILocation(line: 524, column: 25, scope: !1184)
!1187 = !DILocation(line: 524, column: 51, scope: !1184)
!1188 = !DILocation(line: 524, column: 23, scope: !1184)
!1189 = !DILocation(line: 524, column: 17, scope: !1162)
!1190 = !DILocation(line: 525, column: 23, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 524, column: 58)
!1192 = !DILocation(line: 525, column: 21, scope: !1191)
!1193 = !DILocation(line: 526, column: 17, scope: !1191)
!1194 = !DILocation(line: 528, column: 19, scope: !1162)
!1195 = !DILocation(line: 528, column: 17, scope: !1162)
!1196 = !DILocation(line: 529, column: 13, scope: !1162)
!1197 = !DILocation(line: 531, column: 34, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !2, file: !3, line: 531, column: 13)
!1199 = !DILocation(line: 531, column: 13, scope: !1198)
!1200 = !DILocation(line: 531, column: 39, scope: !1198)
!1201 = !DILocation(line: 531, column: 48, scope: !1198)
!1202 = !DILocation(line: 531, column: 45, scope: !1198)
!1203 = !DILocation(line: 531, column: 13, scope: !2)
!1204 = !DILocation(line: 533, column: 13, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 531, column: 55)
!1206 = !DILocation(line: 535, column: 38, scope: !2)
!1207 = !DILocation(line: 535, column: 17, scope: !2)
!1208 = !DILocation(line: 535, column: 9, scope: !2)
!1209 = !DILocation(line: 536, column: 1, scope: !2)
!1210 = distinct !DISubprogram(name: "mavlink_signature_check", scope: !3, file: !3, line: 123, type: !1211, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !168)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!209, !1213, !1215, !423}
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_signing_t", file: !9, line: 254, baseType: !195)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_signing_streams_t", file: !9, line: 271, baseType: !214)
!1217 = !DILocalVariable(name: "signing", arg: 1, scope: !1210, file: !3, line: 123, type: !1213)
!1218 = !DILocation(line: 123, column: 64, scope: !1210)
!1219 = !DILocalVariable(name: "signing_streams", arg: 2, scope: !1210, file: !3, line: 124, type: !1215)
!1220 = !DILocation(line: 124, column: 37, scope: !1210)
!1221 = !DILocalVariable(name: "msg", arg: 3, scope: !1210, file: !3, line: 125, type: !423)
!1222 = !DILocation(line: 125, column: 35, scope: !1210)
!1223 = !DILocation(line: 127, column: 6, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 127, column: 6)
!1225 = !DILocation(line: 127, column: 14, scope: !1224)
!1226 = !DILocation(line: 127, column: 6, scope: !1210)
!1227 = !DILocation(line: 128, column: 3, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1224, file: !3, line: 127, column: 23)
!1229 = !DILocalVariable(name: "p", scope: !1210, file: !3, line: 130, type: !118)
!1230 = !DILocation(line: 130, column: 24, scope: !1210)
!1231 = !DILocation(line: 130, column: 46, scope: !1210)
!1232 = !DILocation(line: 130, column: 51, scope: !1210)
!1233 = !DILocalVariable(name: "psig", scope: !1210, file: !3, line: 131, type: !118)
!1234 = !DILocation(line: 131, column: 17, scope: !1210)
!1235 = !DILocation(line: 131, column: 24, scope: !1210)
!1236 = !DILocation(line: 131, column: 29, scope: !1210)
!1237 = !DILocalVariable(name: "incoming_signature", scope: !1210, file: !3, line: 132, type: !118)
!1238 = !DILocation(line: 132, column: 24, scope: !1210)
!1239 = !DILocation(line: 132, column: 45, scope: !1210)
!1240 = !DILocation(line: 132, column: 49, scope: !1210)
!1241 = !DILocalVariable(name: "ctx", scope: !1210, file: !3, line: 133, type: !1242)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "mavlink_sha256_ctx", file: !128, line: 60, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 53, size: 832, elements: !1244)
!1244 = !{!1245, !1247, !1249}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !1243, file: !128, line: 54, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !162)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1243, file: !128, line: 55, baseType: !1248, size: 256, offset: 64)
!1248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, elements: !259)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1243, file: !128, line: 59, baseType: !1250, size: 512, offset: 320)
!1250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1243, file: !128, line: 56, size: 512, elements: !1251)
!1251 = !{!1252, !1254}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "save_bytes", scope: !1250, file: !128, line: 57, baseType: !1253, size: 512)
!1253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, elements: !131)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "save_u32", scope: !1250, file: !128, line: 58, baseType: !1255, size: 512)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, elements: !170)
!1256 = !DILocation(line: 133, column: 21, scope: !1210)
!1257 = !DILocalVariable(name: "signature", scope: !1210, file: !3, line: 134, type: !225)
!1258 = !DILocation(line: 134, column: 10, scope: !1210)
!1259 = !DILocalVariable(name: "i", scope: !1210, file: !3, line: 135, type: !143)
!1260 = !DILocation(line: 135, column: 11, scope: !1210)
!1261 = !DILocation(line: 137, column: 2, scope: !1210)
!1262 = !DILocation(line: 138, column: 30, scope: !1210)
!1263 = !DILocation(line: 138, column: 39, scope: !1210)
!1264 = !DILocation(line: 138, column: 2, scope: !1210)
!1265 = !DILocation(line: 139, column: 30, scope: !1210)
!1266 = !DILocation(line: 139, column: 2, scope: !1210)
!1267 = !DILocation(line: 140, column: 30, scope: !1210)
!1268 = !DILocation(line: 140, column: 49, scope: !1210)
!1269 = !DILocation(line: 140, column: 54, scope: !1210)
!1270 = !DILocation(line: 140, column: 2, scope: !1210)
!1271 = !DILocation(line: 141, column: 30, scope: !1210)
!1272 = !DILocation(line: 141, column: 35, scope: !1210)
!1273 = !DILocation(line: 141, column: 2, scope: !1210)
!1274 = !DILocation(line: 142, column: 30, scope: !1210)
!1275 = !DILocation(line: 142, column: 2, scope: !1210)
!1276 = !DILocation(line: 143, column: 32, scope: !1210)
!1277 = !DILocation(line: 143, column: 2, scope: !1210)
!1278 = !DILocation(line: 144, column: 13, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 144, column: 6)
!1280 = !DILocation(line: 144, column: 24, scope: !1279)
!1281 = !DILocation(line: 144, column: 6, scope: !1279)
!1282 = !DILocation(line: 144, column: 47, scope: !1279)
!1283 = !DILocation(line: 144, column: 6, scope: !1210)
!1284 = !DILocation(line: 145, column: 3, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1279, file: !3, line: 144, column: 53)
!1286 = !DILocalVariable(name: "tstamp", scope: !1210, file: !3, line: 152, type: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tstamp", scope: !1210, file: !3, line: 149, size: 64, elements: !1288)
!1288 = !{!1289, !1290}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "t64", scope: !1287, file: !3, line: 150, baseType: !155, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "t8", scope: !1287, file: !3, line: 151, baseType: !1291, size: 64)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !259)
!1292 = !DILocation(line: 152, column: 4, scope: !1210)
!1293 = !DILocalVariable(name: "link_id", scope: !1210, file: !3, line: 153, type: !19)
!1294 = !DILocation(line: 153, column: 10, scope: !1210)
!1295 = !DILocation(line: 153, column: 20, scope: !1210)
!1296 = !DILocation(line: 154, column: 9, scope: !1210)
!1297 = !DILocation(line: 154, column: 13, scope: !1210)
!1298 = !DILocation(line: 155, column: 16, scope: !1210)
!1299 = !DILocation(line: 155, column: 2, scope: !1210)
!1300 = !DILocation(line: 155, column: 20, scope: !1210)
!1301 = !DILocation(line: 155, column: 24, scope: !1210)
!1302 = !DILocation(line: 157, column: 6, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 157, column: 6)
!1304 = !DILocation(line: 157, column: 22, scope: !1303)
!1305 = !DILocation(line: 157, column: 6, scope: !1210)
!1306 = !DILocation(line: 158, column: 3, scope: !1307)
